OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/*----------------------------------------------------------------------------------------------------------*/
/*  LPSCC_CLKSEL0 constant definitions.  (Write-protection)                                                 */
/*----------------------------------------------------------------------------------------------------------*/
#define LPSCC_CLKSEL0_LPUART0SEL_HIRC   (0x0UL << LPSCC_CLKSEL0_LPUART0SEL_Pos)
#define LPSCC_CLKSEL0_LPUART0SEL_MIRC   (0x1UL << LPSCC_CLKSEL0_LPUART0SEL_Pos)
#define LPSCC_CLKSEL0_LPUART0SEL_LXT    (0x2UL << LPSCC_CLKSEL0_LPUART0SEL_Pos)

#define LPSCC_CLKSEL0_LPSPI0SEL_HIRC    (0x0UL << LPSCC_CLKSEL0_LPSPI0SEL_Pos)
#define LPSCC_CLKSEL0_LPSPI0SEL_MIRC    (0x1UL << LPSCC_CLKSEL0_LPSPI0SEL_Pos)

#define LPSCC_CLKSEL0_TTMR0SEL_HIRC     (0x0UL << LPSCC_CLKSEL0_TTMR0SEL_Pos)
#define LPSCC_CLKSEL0_TTMR0SEL_MIRC     (0x1UL << LPSCC_CLKSEL0_TTMR0SEL_Pos)
#define LPSCC_CLKSEL0_TTMR0SEL_LXT      (0x2UL << LPSCC_CLKSEL0_TTMR0SEL_Pos)
#define LPSCC_CLKSEL0_TTMR0SEL_LIRC     (0x3UL << LPSCC_CLKSEL0_TTMR0SEL_Pos)

#define LPSCC_CLKSEL0_TTMR1SEL_HIRC     (0x0UL << LPSCC_CLKSEL0_TTMR1SEL_Pos)
#define LPSCC_CLKSEL0_TTMR1SEL_MIRC     (0x1UL << LPSCC_CLKSEL0_TTMR1SEL_Pos)
#define LPSCC_CLKSEL0_TTMR1SEL_LXT      (0x2UL << LPSCC_CLKSEL0_TTMR1SEL_Pos)
#define LPSCC_CLKSEL0_TTMR1SEL_LIRC     (0x3UL << LPSCC_CLKSEL0_TTMR1SEL_Pos)

#define LPSCC_CLKSEL0_LPTMR0SEL_HIRC    (0x0UL << LPSCC_CLKSEL0_LPTMR0SEL_Pos)
#define LPSCC_CLKSEL0_LPTMR0SEL_MIRC    (0x1UL << LPSCC_CLKSEL0_LPTMR0SEL_Pos)
#define LPSCC_CLKSEL0_LPTMR0SEL_LXT     (0x2UL << LPSCC_CLKSEL0_LPTMR0SEL_Pos)
#define LPSCC_CLKSEL0_LPTMR0SEL_LIRC    (0x3UL << LPSCC_CLKSEL0_LPTMR0SEL_Pos)
#define LPSCC_CLKSEL0_LPTMR0SEL_EXT     (0x4UL << LPSCC_CLKSEL0_LPTMR0SEL_Pos)

#define LPSCC_CLKSEL0_LPTMR1SEL_HIRC    (0x0UL << LPSCC_CLKSEL0_LPTMR1SEL_Pos)
#define LPSCC_CLKSEL0_LPTMR1SEL_MIRC    (0x1UL << LPSCC_CLKSEL0_LPTMR1SEL_Pos)
#define LPSCC_CLKSEL0_LPTMR1SEL_LXT     (0x2UL << LPSCC_CLKSEL0_LPTMR1SEL_Pos)
#define LPSCC_CLKSEL0_LPTMR1SEL_LIRC    (0x3UL << LPSCC_CLKSEL0_LPTMR1SEL_Pos)
#define LPSCC_CLKSEL0_LPTMR1SEL_EXT     (0x4UL << LPSCC_CLKSEL0_LPTMR1SEL_Pos)

#define LPSCC_CLKSEL0_LPADC0SEL_HIRC    (0x0UL << LPSCC_CLKSEL0_LPADC0SEL_Pos)
#define LPSCC_CLKSEL0_LPADC0SEL_MIRC    (0x1UL << LPSCC_CLKSEL0_LPADC0SEL_Pos)
#define LPSCC_CLKSEL0_LPADC0SEL_LXT     (0x2UL << LPSCC_CLKSEL0_LPADC0SEL_Pos)
#define LPSCC_CLKSEL0_LPADC0SEL_PCLK2   (0x3UL << LPSCC_CLKSEL0_LPADC0SEL_Pos)

#define LPSCC_CLKSEL0_TKSEL_HIRC        (0x0UL << LPSCC_CLKSEL0_TKSEL_Pos)
#define LPSCC_CLKSEL0_TKSEL_MIRC        (0x1UL << LPSCC_CLKSEL0_TKSEL_Pos)

#define LPSCC_CLKSEL0_WDTSEL_LXT            (0x1UL << LPSCC_CLKSEL0_WDTSEL_Pos)
#define LPSCC_CLKSEL0_WDTSEL_HCLK_DIV2048   (0x2UL << LPSCC_CLKSEL0_WDTSEL_Pos)
#define LPSCC_CLKSEL0_WDTSEL_LIRC           (0x3UL << LPSCC_CLKSEL0_WDTSEL_Pos)

/*----------------------------------------------------------------------------------------------------------*/
/*  LPSCC_CLKMCTL constant definitions.  (Write-protection)                                                 */
/*----------------------------------------------------------------------------------------------------------*/
#define LPSCC_CLKMCTL_CLKM0SEL_HCLK1    (0x0UL << LPSCC_CLKMCTL_CLKM0SEL_Pos)
#define LPSCC_CLKMCTL_CLKM0SEL_HIRC     (0x1UL << LPSCC_CLKMCTL_CLKM0SEL_Pos)
#define LPSCC_CLKMCTL_CLKM0SEL_MIRC     (0x2UL << LPSCC_CLKMCTL_CLKM0SEL_Pos)

#define LPSCC_CLKMCTL_CLKM1SEL_HCLK1    (0x0UL << LPSCC_CLKMCTL_CLKM1SEL_Pos)
#define LPSCC_CLKMCTL_CLKM1SEL_HIRC     (0x1UL << LPSCC_CLKMCTL_CLKM1SEL_Pos)
#define LPSCC_CLKMCTL_CLKM1SEL_MIRC     (0x2UL << LPSCC_CLKMCTL_CLKM1SEL_Pos)


/*---------------------------------------------------------------------------------------------------------*/
/*  Multi-Function constant definitions.                                                                   */
/*---------------------------------------------------------------------------------------------------------*/
/* How to use below #define?
Example 1: If user want to set PA.0 as SC0_CLK in initial function,
           user can issue following command to achieve it.

           SYS->GPA_MFPL  = (SYS->GPA_MFPL & (~SYS_GPA_MFPL_PA0MFP_Msk) ) | SYS_GPA_MFPL_PA0_MFP_SC0_CLK  ;

*/
/* PA.0 MFP */
#define SYS_GPA_MFP0_PA0MFP_GPIO            (0x0UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for GPIO              */
#define SYS_GPA_MFP0_PA0MFP_QSPI0_MOSI0     (0x3UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for QSPI0_MOSI0       */
#define SYS_GPA_MFP0_PA0MFP_SPI0_MOSI       (0x4UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for SPI0_MOSI         */
#define SYS_GPA_MFP0_PA0MFP_UART0_RXD       (0x7UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for UART0_RXD         */
#define SYS_GPA_MFP0_PA0MFP_UART1_nRTS      (0x8UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for UART1_nRTS        */
#define SYS_GPA_MFP0_PA0MFP_I2C2_SDA        (0x9UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for I2C2_SDA          */
#define SYS_GPA_MFP0_PA0MFP_CANFD1_RXD      (0xAUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for CANFD1_RXD        */
#define SYS_GPA_MFP0_PA0MFP_EPWM0_BRAKE0    (0xBUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for EPWM0_BRAKE0      */
#define SYS_GPA_MFP0_PA0MFP_PWM0_CH0        (0xCUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for PWM0_CH0          */
#define SYS_GPA_MFP0_PA0MFP_EPWM0_CH5       (0xDUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for EPWM0_CH5         */
#define SYS_GPA_MFP0_PA0MFP_ACMP2_WLAT      (0xEUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for ACMP2_WLAT        */
#define SYS_GPA_MFP0_PA0MFP_DAC0_ST         (0xFUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for DAC0_ST           */
#define SYS_GPA_MFP0_PA0MFP_TK_TK7          (0x10UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for TK_TK7            */
#define SYS_GPA_MFP0_PA0MFP_UTCPD0_VCNEN1   (0x11UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for UTCPD0_VCNEN1     */
#define SYS_GPA_MFP0_PA0MFP_LPSPI0_MOSI     (0x14UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for LPSPI0_MOSI       */
#define SYS_GPA_MFP0_PA0MFP_LPUART0_RXD     (0x15UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for LPUART0_RXD       */
#define SYS_GPA_MFP0_PA0MFP_LPIO0           (0x17UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for LPIO0             */

/* PA.1 MFP */
#define SYS_GPA_MFP0_PA1MFP_GPIO            (0x0UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for GPIO              */
#define SYS_GPA_MFP0_PA1MFP_QSPI0_MISO0     (0x3UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for QSPI0_MISO0       */
#define SYS_GPA_MFP0_PA1MFP_SPI0_MISO       (0x4UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for SPI0_MISO         */
#define SYS_GPA_MFP0_PA1MFP_UART0_TXD       (0x7UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for UART0_TXD         */
#define SYS_GPA_MFP0_PA1MFP_UART1_nCTS      (0x8UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for UART1_nCTS        */
#define SYS_GPA_MFP0_PA1MFP_I2C2_SCL        (0x9UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for I2C2_SCL          */
#define SYS_GPA_MFP0_PA1MFP_CANFD1_TXD      (0xAUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for CANFD1_TXD        */
#define SYS_GPA_MFP0_PA1MFP_EQEI0_INDEX     (0xBUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for EQEI0_INDEX       */
#define SYS_GPA_MFP0_PA1MFP_PWM0_CH1        (0xCUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for PWM0_CH1          */
#define SYS_GPA_MFP0_PA1MFP_EPWM0_CH4       (0xDUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for EPWM0_CH4         */
#define SYS_GPA_MFP0_PA1MFP_ACMP2_O         (0xEUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for ACMP2_O           */
#define SYS_GPA_MFP0_PA1MFP_DAC1_ST         (0xFUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for DAC1_ST           */
#define SYS_GPA_MFP0_PA1MFP_TK_TK6          (0x10UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for TK_TK6            */
#define SYS_GPA_MFP0_PA1MFP_UTCPD0_FRSTX1   (0x11UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for UTCPD0_FRSTX1     */
#define SYS_GPA_MFP0_PA1MFP_UTCPD0_DISCHG   (0x12UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for UTCPD0_DISCHG     */
#define SYS_GPA_MFP0_PA1MFP_LPSPI0_MISO     (0x14UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for LPSPI0_MISO       */
#define SYS_GPA_MFP0_PA1MFP_LPUART0_TXD     (0x15UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for LPUART0_TXD       */
#define SYS_GPA_MFP0_PA1MFP_LPIO1           (0x17UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for LPIO1             */

/* PA.2 MFP */
#define SYS_GPA_MFP0_PA2MFP_GPIO            (0x0UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for GPIO              */
#define SYS_GPA_MFP0_PA2MFP_QSPI0_CLK       (0x3UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for QSPI0_CLK         */
#define SYS_GPA_MFP0_PA2MFP_SPI0_CLK        (0x4UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for SPI0_CLK          */
#define SYS_GPA_MFP0_PA2MFP_UART4_RXD       (0x5UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for UART4_RXD         */
#define SYS_GPA_MFP0_PA2MFP_I2C0_SMBSUS     (0x7UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for I2C0_SMBSUS       */
#define SYS_GPA_MFP0_PA2MFP_UART1_RXD       (0x8UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for UART1_RXD         */
#define SYS_GPA_MFP0_PA2MFP_I2C1_SDA        (0x9UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for I2C1_SDA          */
#define SYS_GPA_MFP0_PA2MFP_EQEI0_A         (0xBUL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for EQEI0_A           */
#define SYS_GPA_MFP0_PA2MFP_PWM0_CH2        (0xCUL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for PWM0_CH2          */
#define SYS_GPA_MFP0_PA2MFP_EPWM0_CH3       (0xDUL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for EPWM0_CH3         */
#define SYS_GPA_MFP0_PA2MFP_TK_TK5          (0x10UL<<SYS_GPA_MFP0_PA2MFP_Pos)   /*!< GPA_MFP0 PA2 setting for TK_TK5            */
#define SYS_GPA_MFP0_PA2MFP_UTCPD0_VBSRCEN  (0x11UL<<SYS_GPA_MFP0_PA2MFP_Pos)   /*!< GPA_MFP0 PA2 setting for UTCPD0_VBSRCEN    */
#define SYS_GPA_MFP0_PA2MFP_LPSPI0_CLK      (0x14UL<<SYS_GPA_MFP0_PA2MFP_Pos)   /*!< GPA_MFP0 PA2 setting for LPSPI0_CLK        */

/* PA.3 MFP */
#define SYS_GPA_MFP0_PA3MFP_GPIO            (0x0UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for GPIO              */
#define SYS_GPA_MFP0_PA3MFP_QSPI0_SS        (0x3UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for QSPI0_SS          */
#define SYS_GPA_MFP0_PA3MFP_SPI0_SS         (0x4UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for SPI0_SS           */
#define SYS_GPA_MFP0_PA3MFP_UART4_TXD       (0x5UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for UART4_TXD         */
#define SYS_GPA_MFP0_PA3MFP_TK_SE           (0x6UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for TK_SE             */
#define SYS_GPA_MFP0_PA3MFP_I2C0_SMBAL      (0x7UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for I2C0_SMBAL        */
#define SYS_GPA_MFP0_PA3MFP_UART1_TXD       (0x8UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for UART1_TXD         */
#define SYS_GPA_MFP0_PA3MFP_I2C1_SCL        (0x9UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for I2C1_SCL          */
#define SYS_GPA_MFP0_PA3MFP_PWM1_BRAKE1     (0xAUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for PWM1_BRAKE1       */
#define SYS_GPA_MFP0_PA3MFP_EQEI0_B         (0xBUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for EQEI0_B           */
#define SYS_GPA_MFP0_PA3MFP_PWM0_CH3        (0xCUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for PWM0_CH3          */
#define SYS_GPA_MFP0_PA3MFP_EPWM0_CH2       (0xDUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for EPWM0_CH2         */
#define SYS_GPA_MFP0_PA3MFP_CLKO            (0xEUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for CLKO              */
#define SYS_GPA_MFP0_PA3MFP_EPWM1_BRAKE1    (0xFUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for EPWM1_BRAKE1      */
#define SYS_GPA_MFP0_PA3MFP_TK_TK4          (0x10UL<<SYS_GPA_MFP0_PA3MFP_Pos)   /*!< GPA_MFP0 PA3 setting for TK_TK4            */
#define SYS_GPA_MFP0_PA3MFP_UTCPD0_VBSNKEN  (0x11UL<<SYS_GPA_MFP0_PA3MFP_Pos)   /*!< GPA_MFP0 PA3 setting for UTCPD0_VBSNKEN    */
#define SYS_GPA_MFP0_PA3MFP_LPSPI0_SS       (0x14UL<<SYS_GPA_MFP0_PA3MFP_Pos)   /*!< GPA_MFP0 PA3 setting for LPSPI0_SS         */

/* PA.4 MFP */
#define SYS_GPA_MFP1_PA4MFP_GPIO            (0x0UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for GPIO              */
#define SYS_GPA_MFP1_PA4MFP_QSPI0_MOSI1     (0x3UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for QSPI0_MOSI1       */
#define SYS_GPA_MFP1_PA4MFP_SPI0_I2SMCLK    (0x4UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for SPI0_I2SMCLK      */
#define SYS_GPA_MFP1_PA4MFP_UART0_nRTS      (0x7UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for UART0_nRTS        */
#define SYS_GPA_MFP1_PA4MFP_UART0_RXD       (0x8UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for UART0_RXD         */
#define SYS_GPA_MFP1_PA4MFP_I2C0_SDA        (0x9UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for I2C0_SDA          */
#define SYS_GPA_MFP1_PA4MFP_CANFD0_RXD      (0xAUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for CANFD0_RXD        */
#define SYS_GPA_MFP1_PA4MFP_UART5_RXD       (0xBUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for UART5_RXD         */
#define SYS_GPA_MFP1_PA4MFP_PWM0_CH4        (0xCUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for PWM0_CH4          */
#define SYS_GPA_MFP1_PA4MFP_EPWM0_CH1       (0xDUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for EPWM0_CH1         */
#define SYS_GPA_MFP1_PA4MFP_EQEI0_A         (0xEUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for EQEI0_A           */
#define SYS_GPA_MFP1_PA4MFP_TK_TK3          (0x10UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for TK_TK3            */
#define SYS_GPA_MFP1_PA4MFP_UTCPD0_VBSRCEN  (0x11UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for UTCPD0_VBSRCEN    */
#define SYS_GPA_MFP1_PA4MFP_LPUART0_RXD     (0x14UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for LPUART0_RXD       */
#define SYS_GPA_MFP1_PA4MFP_LPUART0_nRTS    (0x15UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for LPUART0_nRTS      */
#define SYS_GPA_MFP1_PA4MFP_LPI2C0_SDA      (0x16UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for LPI2C0_SDA        */

