OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PA.11 MFP */
#define SYS_GPA_MFP2_PA11MFP_GPIO           (0x0UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for GPIO             */
#define SYS_GPA_MFP2_PA11MFP_ACMP0_P0       (0x1UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for ACMP0_P0         */
#define SYS_GPA_MFP2_PA11MFP_OPA2_O         (0x1UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for OPA2_O           */
#define SYS_GPA_MFP2_PA11MFP_EBI_nRD        (0x2UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for EBI_nRD          */
#define SYS_GPA_MFP2_PA11MFP_SPI3_SS        (0x5UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for SPI3_SS          */
#define SYS_GPA_MFP2_PA11MFP_USCI0_CLK      (0x6UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for USCI0_CLK        */
#define SYS_GPA_MFP2_PA11MFP_I2C2_SCL       (0x7UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for I2C2_SCL         */
#define SYS_GPA_MFP2_PA11MFP_UART6_TXD      (0x8UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for UART6_TXD        */
#define SYS_GPA_MFP2_PA11MFP_PWM0_CH0       (0x9UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for PWM0_CH0         */
#define SYS_GPA_MFP2_PA11MFP_EPWM0_SYNC_OUT (0xAUL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for EPWM0_SYNC_OUT   */
#define SYS_GPA_MFP2_PA11MFP_TM0_EXT        (0xDUL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for TM0_EXT          */
#define SYS_GPA_MFP2_PA11MFP_DAC1_ST        (0xEUL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for DAC1_ST          */
#define SYS_GPA_MFP2_PA11MFP_LPTM0_EXT      (0x17UL<<SYS_GPA_MFP2_PA11MFP_Pos)  /*!< GPA_MFP2 PA11 setting for LPTM0_EXT        */

/* PA.12 MFP */
#define SYS_GPA_MFP3_PA12MFP_GPIO           (0x0UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for GPIO             */
#define SYS_GPA_MFP3_PA12MFP_UART4_TXD      (0x3UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for UART4_TXD        */
#define SYS_GPA_MFP3_PA12MFP_I2C1_SCL       (0x4UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for I2C1_SCL         */
#define SYS_GPA_MFP3_PA12MFP_SPI2_SS        (0x5UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for SPI2_SS          */
#define SYS_GPA_MFP3_PA12MFP_CANFD1_TXD     (0x6UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for CANFD1_TXD       */
#define SYS_GPA_MFP3_PA12MFP_SPI0_SS        (0x8UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for SPI0_SS          */
#define SYS_GPA_MFP3_PA12MFP_PWM1_CH2       (0xBUL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for PWM1_CH2         */
#define SYS_GPA_MFP3_PA12MFP_EQEI1_INDEX    (0xCUL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for EQEI1_INDEX      */
#define SYS_GPA_MFP3_PA12MFP_ECAP1_IC0      (0xDUL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for ECAP1_IC0        */
#define SYS_GPA_MFP3_PA12MFP_USB_VBUS       (0xEUL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for USB_VBUS         */
#define SYS_GPA_MFP3_PA12MFP_LPSPI0_SS      (0x14UL<<SYS_GPA_MFP3_PA12MFP_Pos)  /*!< GPA_MFP3 PA12 setting for LPSPI0_SS        */

/* PA.13 MFP */
#define SYS_GPA_MFP3_PA13MFP_GPIO           (0x0UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for GPIO             */
#define SYS_GPA_MFP3_PA13MFP_UART4_RXD      (0x3UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for UART4_RXD        */
#define SYS_GPA_MFP3_PA13MFP_I2C1_SDA       (0x4UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for I2C1_SDA         */
#define SYS_GPA_MFP3_PA13MFP_SPI2_CLK       (0x5UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for SPI2_CLK         */
#define SYS_GPA_MFP3_PA13MFP_CANFD1_RXD     (0x6UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for CANFD1_RXD       */
#define SYS_GPA_MFP3_PA13MFP_SPI0_CLK       (0x8UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for SPI0_CLK         */
#define SYS_GPA_MFP3_PA13MFP_PWM1_CH3       (0xBUL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for PWM1_CH3         */
#define SYS_GPA_MFP3_PA13MFP_EQEI1_A        (0xCUL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for EQEI1_A          */
#define SYS_GPA_MFP3_PA13MFP_ECAP1_IC1      (0xDUL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for ECAP1_IC1        */
#define SYS_GPA_MFP3_PA13MFP_USB_D_N        (0xEUL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for USB_D-           */
#define SYS_GPA_MFP3_PA13MFP_LPSPI0_CLK     (0x14UL<<SYS_GPA_MFP3_PA13MFP_Pos)  /*!< GPA_MFP3 PA13 setting for LPSPI0_CLK       */

/* PA.14 MFP */
#define SYS_GPA_MFP3_PA14MFP_GPIO           (0x0UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for GPIO             */
#define SYS_GPA_MFP3_PA14MFP_UART0_TXD      (0x3UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for UART0_TXD        */
#define SYS_GPA_MFP3_PA14MFP_EBI_AD5        (0x4UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for EBI_AD5          */
#define SYS_GPA_MFP3_PA14MFP_SPI2_MISO      (0x5UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for SPI2_MISO        */
#define SYS_GPA_MFP3_PA14MFP_I2C2_SCL       (0x6UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for I2C2_SCL         */
#define SYS_GPA_MFP3_PA14MFP_SPI0_MISO      (0x8UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for SPI0_MISO        */
#define SYS_GPA_MFP3_PA14MFP_PWM1_CH4       (0xBUL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for PWM1_CH4         */
#define SYS_GPA_MFP3_PA14MFP_EQEI1_B        (0xCUL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for EQEI1_B          */
#define SYS_GPA_MFP3_PA14MFP_ECAP1_IC2      (0xDUL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for ECAP1_IC2        */
#define SYS_GPA_MFP3_PA14MFP_USB_D_P        (0xEUL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for USB_D+           */
#define SYS_GPA_MFP3_PA14MFP_LPSPI0_MISO    (0x14UL<<SYS_GPA_MFP3_PA14MFP_Pos)  /*!< GPA_MFP3 PA14 setting for LPSPI0_MISO      */

/* PA.15 MFP */
#define SYS_GPA_MFP3_PA15MFP_GPIO           (0x0UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for GPIO             */
#define SYS_GPA_MFP3_PA15MFP_UART0_RXD      (0x3UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for UART0_RXD        */
#define SYS_GPA_MFP3_PA15MFP_SPI2_MOSI      (0x5UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for SPI2_MOSI        */
#define SYS_GPA_MFP3_PA15MFP_I2C2_SDA       (0x6UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for I2C2_SDA         */
#define SYS_GPA_MFP3_PA15MFP_SPI0_MOSI      (0x8UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for SPI0_MOSI        */
#define SYS_GPA_MFP3_PA15MFP_PWM1_CH5       (0xBUL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for PWM1_CH5         */
#define SYS_GPA_MFP3_PA15MFP_EPWM0_SYNC_IN  (0xCUL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for EPWM0_SYNC_IN    */
#define SYS_GPA_MFP3_PA15MFP_USB_OTG_ID     (0xEUL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for USB_OTG_ID       */
#define SYS_GPA_MFP3_PA15MFP_LPSPI0_MOSI    (0x14UL<<SYS_GPA_MFP3_PA15MFP_Pos)  /*!< GPA_MFP3 PA15 setting for LPSPI0_MOSI      */

/* PB.0 MFP */
#define SYS_GPB_MFP0_PB0MFP_GPIO            (0x0UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for GPIO              */
#define SYS_GPB_MFP0_PB0MFP_EADC0_CH0       (0x1UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EADC0_CH0         */
#define SYS_GPB_MFP0_PB0MFP_LPADC0_CH0      (0x1UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for LPADC0_CH0        */
#define SYS_GPB_MFP0_PB0MFP_ACMP2_P1        (0x1UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for ACMP2_P1          */
#define SYS_GPB_MFP0_PB0MFP_OPA0_P0         (0x1UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for OPA0_P0           */
#define SYS_GPB_MFP0_PB0MFP_EBI_ADR9        (0x2UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EBI_ADR9          */
#define SYS_GPB_MFP0_PB0MFP_SPI3_I2SMCLK    (0x5UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for SPI3_I2SMCLK      */
#define SYS_GPB_MFP0_PB0MFP_USCI0_CTL0      (0x6UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for USCI0_CTL0        */
#define SYS_GPB_MFP0_PB0MFP_UART2_RXD       (0x7UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for UART2_RXD         */
#define SYS_GPB_MFP0_PB0MFP_SPI0_I2SMCLK    (0x8UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for SPI0_I2SMCLK      */
#define SYS_GPB_MFP0_PB0MFP_I2C1_SDA        (0x9UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for I2C1_SDA          */
#define SYS_GPB_MFP0_PB0MFP_QSPI0_MOSI1     (0xAUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for QSPI0_MOSI1       */
#define SYS_GPB_MFP0_PB0MFP_EPWM0_CH5       (0xBUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EPWM0_CH5         */
#define SYS_GPB_MFP0_PB0MFP_EPWM1_CH5       (0xCUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EPWM1_CH5         */
#define SYS_GPB_MFP0_PB0MFP_EPWM0_BRAKE1    (0xDUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EPWM0_BRAKE1      */
#define SYS_GPB_MFP0_PB0MFP_PWM0_BRAKE1     (0xEUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for PWM0_BRAKE1       */
#define SYS_GPB_MFP0_PB0MFP_UTCPD0_VCNEN2   (0x11UL<<SYS_GPB_MFP0_PB0MFP_Pos)   /*!< GPB_MFP0 PB0 setting for UTCPD0_VCNEN2     */
#define SYS_GPB_MFP0_PB0MFP_LPIO2           (0x17UL<<SYS_GPB_MFP0_PB0MFP_Pos)   /*!< GPB_MFP0 PB0 setting for LPIO2             */

/* PB.1 MFP */
#define SYS_GPB_MFP0_PB1MFP_GPIO            (0x0UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for GPIO              */
#define SYS_GPB_MFP0_PB1MFP_EADC0_CH1       (0x1UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EADC0_CH1         */
#define SYS_GPB_MFP0_PB1MFP_LPADC0_CH1      (0x1UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for LPADC0_CH1        */
#define SYS_GPB_MFP0_PB1MFP_ACMP2_N         (0x1UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for ACMP2_N           */
#define SYS_GPB_MFP0_PB1MFP_OPA0_N0         (0x1UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for OPA0_N0           */
#define SYS_GPB_MFP0_PB1MFP_EBI_ADR8        (0x2UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EBI_ADR8          */
#define SYS_GPB_MFP0_PB1MFP_UART2_TXD       (0x7UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for UART2_TXD         */
#define SYS_GPB_MFP0_PB1MFP_USCI1_CLK       (0x8UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for USCI1_CLK         */
#define SYS_GPB_MFP0_PB1MFP_I2C1_SCL        (0x9UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for I2C1_SCL          */
#define SYS_GPB_MFP0_PB1MFP_QSPI0_MISO1     (0xAUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for QSPI0_MISO1       */
#define SYS_GPB_MFP0_PB1MFP_EPWM0_CH4       (0xBUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EPWM0_CH4         */
#define SYS_GPB_MFP0_PB1MFP_EPWM1_CH4       (0xCUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EPWM1_CH4         */
#define SYS_GPB_MFP0_PB1MFP_EPWM0_BRAKE0    (0xDUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EPWM0_BRAKE0      */
#define SYS_GPB_MFP0_PB1MFP_PWM0_BRAKE0     (0xEUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for PWM0_BRAKE0       */
#define SYS_GPB_MFP0_PB1MFP_UTCPD0_VBDCHG   (0x11UL<<SYS_GPB_MFP0_PB1MFP_Pos)   /*!< GPB_MFP0 PB1 setting for UTCPD0_VBDCHG     */
#define SYS_GPB_MFP0_PB1MFP_LPIO3           (0x17UL<<SYS_GPB_MFP0_PB1MFP_Pos)   /*!< GPB_MFP0 PB1 setting for LPIO3             */

/* PB.2 MFP */
#define SYS_GPB_MFP0_PB2MFP_GPIO            (0x0UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for GPIO              */
#define SYS_GPB_MFP0_PB2MFP_EADC0_CH2       (0x1UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for EADC0_CH2         */
#define SYS_GPB_MFP0_PB2MFP_LPADC0_CH2      (0x1UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for LPADC0_CH2        */
#define SYS_GPB_MFP0_PB2MFP_ACMP0_P1        (0x1UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for ACMP0_P1          */
#define SYS_GPB_MFP0_PB2MFP_OPA0_O          (0x1UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for OPA0_O            */
#define SYS_GPB_MFP0_PB2MFP_EBI_ADR3        (0x2UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for EBI_ADR3          */
#define SYS_GPB_MFP0_PB2MFP_I2C1_SDA        (0x4UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for I2C1_SDA          */
#define SYS_GPB_MFP0_PB2MFP_SPI1_SS         (0x5UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for SPI1_SS           */
#define SYS_GPB_MFP0_PB2MFP_UART1_RXD       (0x6UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for UART1_RXD         */
#define SYS_GPB_MFP0_PB2MFP_UART5_nCTS      (0x7UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for UART5_nCTS        */
#define SYS_GPB_MFP0_PB2MFP_USCI1_DAT0      (0x8UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for USCI1_DAT0        */
#define SYS_GPB_MFP0_PB2MFP_EPWM0_CH3       (0xBUL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for EPWM0_CH3         */
#define SYS_GPB_MFP0_PB2MFP_TM3             (0xEUL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for TM3               */
#define SYS_GPB_MFP0_PB2MFP_INT3            (0xFUL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for INT3              */
#define SYS_GPB_MFP0_PB2MFP_LPIO6           (0x17UL<<SYS_GPB_MFP0_PB2MFP_Pos)   /*!< GPB_MFP0 PB2 setting for LPIO6             */

