OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PB.3 MFP */
#define SYS_GPB_MFP0_PB3MFP_GPIO            (0x0UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for GPIO              */
#define SYS_GPB_MFP0_PB3MFP_EADC0_CH3       (0x1UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for EADC0_CH3         */
#define SYS_GPB_MFP0_PB3MFP_LPADC0_CH3      (0x1UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for LPADC0_CH3        */
#define SYS_GPB_MFP0_PB3MFP_ACMP0_N         (0x1UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for ACMP0_N           */
#define SYS_GPB_MFP0_PB3MFP_OPA2_P0         (0x1UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for OPA2_P0           */
#define SYS_GPB_MFP0_PB3MFP_EBI_ADR2        (0x2UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for EBI_ADR2          */
#define SYS_GPB_MFP0_PB3MFP_I2C1_SCL        (0x4UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for I2C1_SCL          */
#define SYS_GPB_MFP0_PB3MFP_SPI1_CLK        (0x5UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for SPI1_CLK          */
#define SYS_GPB_MFP0_PB3MFP_UART1_TXD       (0x6UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for UART1_TXD         */
#define SYS_GPB_MFP0_PB3MFP_UART5_nRTS      (0x7UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for UART5_nRTS        */
#define SYS_GPB_MFP0_PB3MFP_USCI1_DAT1      (0x8UL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for USCI1_DAT1        */
#define SYS_GPB_MFP0_PB3MFP_EPWM0_CH2       (0xBUL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for EPWM0_CH2         */
#define SYS_GPB_MFP0_PB3MFP_PWM0_BRAKE0     (0xDUL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for PWM0_BRAKE0       */
#define SYS_GPB_MFP0_PB3MFP_TM2             (0xEUL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for TM2               */
#define SYS_GPB_MFP0_PB3MFP_INT2            (0xFUL<<SYS_GPB_MFP0_PB3MFP_Pos)    /*!< GPB_MFP0 PB3 setting for INT2              */
#define SYS_GPB_MFP0_PB3MFP_LPIO7           (0x17UL<<SYS_GPB_MFP0_PB3MFP_Pos)   /*!< GPB_MFP0 PB3 setting for LPIO7             */

/* PB.4 MFP */
#define SYS_GPB_MFP1_PB4MFP_GPIO            (0x0UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for GPIO              */
#define SYS_GPB_MFP1_PB4MFP_EADC0_CH4       (0x1UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for EADC0_CH4         */
#define SYS_GPB_MFP1_PB4MFP_LPADC0_CH4      (0x1UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for LPADC0_CH4        */
#define SYS_GPB_MFP1_PB4MFP_ACMP1_P1        (0x1UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for ACMP1_P1          */
#define SYS_GPB_MFP1_PB4MFP_OPA2_N0         (0x1UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for OPA2_N0           */
#define SYS_GPB_MFP1_PB4MFP_EBI_ADR1        (0x2UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for EBI_ADR1          */
#define SYS_GPB_MFP1_PB4MFP_SPI1_MOSI       (0x5UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for SPI1_MOSI         */
#define SYS_GPB_MFP1_PB4MFP_I2C0_SDA        (0x6UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for I2C0_SDA          */
#define SYS_GPB_MFP1_PB4MFP_UART5_RXD       (0x7UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for UART5_RXD         */
#define SYS_GPB_MFP1_PB4MFP_USCI1_CTL1      (0x8UL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for USCI1_CTL1        */
#define SYS_GPB_MFP1_PB4MFP_EPWM0_CH1       (0xBUL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for EPWM0_CH1         */
#define SYS_GPB_MFP1_PB4MFP_UART2_RXD       (0xDUL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for UART2_RXD         */
#define SYS_GPB_MFP1_PB4MFP_TM1             (0xEUL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for TM1               */
#define SYS_GPB_MFP1_PB4MFP_INT1            (0xFUL<<SYS_GPB_MFP1_PB4MFP_Pos)    /*!< GPB_MFP1 PB4 setting for INT1              */
#define SYS_GPB_MFP1_PB4MFP_LPI2C0_SDA      (0x16UL<<SYS_GPB_MFP1_PB4MFP_Pos)   /*!< GPB_MFP1 PB4 setting for LPI2C0_SDA        */
#define SYS_GPB_MFP1_PB4MFP_LPTM1           (0x17UL<<SYS_GPB_MFP1_PB4MFP_Pos)   /*!< GPB_MFP1 PB4 setting for LPTM1             */

/* PB.5 MFP */
#define SYS_GPB_MFP1_PB5MFP_GPIO            (0x0UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for GPIO              */
#define SYS_GPB_MFP1_PB5MFP_EADC0_CH5       (0x1UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for EADC0_CH5         */
#define SYS_GPB_MFP1_PB5MFP_LPADC0_CH5      (0x1UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for LPADC0_CH5        */
#define SYS_GPB_MFP1_PB5MFP_ACMP1_N         (0x1UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for ACMP1_N           */
#define SYS_GPB_MFP1_PB5MFP_OPA1_P1         (0x1UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for OPA1_P1           */
#define SYS_GPB_MFP1_PB5MFP_EBI_ADR0        (0x2UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for EBI_ADR0          */
#define SYS_GPB_MFP1_PB5MFP_SPI1_MISO       (0x5UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for SPI1_MISO         */
#define SYS_GPB_MFP1_PB5MFP_I2C0_SCL        (0x6UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for I2C0_SCL          */
#define SYS_GPB_MFP1_PB5MFP_UART5_TXD       (0x7UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for UART5_TXD         */
#define SYS_GPB_MFP1_PB5MFP_USCI1_CTL0      (0x8UL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for USCI1_CTL0        */
#define SYS_GPB_MFP1_PB5MFP_EPWM0_CH0       (0xBUL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for EPWM0_CH0         */
#define SYS_GPB_MFP1_PB5MFP_UART2_TXD       (0xDUL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for UART2_TXD         */
#define SYS_GPB_MFP1_PB5MFP_TM0             (0xEUL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for TM0               */
#define SYS_GPB_MFP1_PB5MFP_INT0            (0xFUL<<SYS_GPB_MFP1_PB5MFP_Pos)    /*!< GPB_MFP1 PB5 setting for INT0              */
#define SYS_GPB_MFP1_PB5MFP_LPI2C0_SCL      (0x16UL<<SYS_GPB_MFP1_PB5MFP_Pos)   /*!< GPB_MFP1 PB5 setting for LPI2C0_SCL        */
#define SYS_GPB_MFP1_PB5MFP_LPTM0           (0x17UL<<SYS_GPB_MFP1_PB5MFP_Pos)   /*!< GPB_MFP1 PB5 setting for LPTM0             */

