OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PB.6 MFP */
#define SYS_GPB_MFP1_PB6MFP_GPIO            (0x0UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for GPIO              */
#define SYS_GPB_MFP1_PB6MFP_EADC0_CH6       (0x1UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EADC0_CH6         */
#define SYS_GPB_MFP1_PB6MFP_LPADC0_CH6      (0x1UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for LPADC0_CH6        */
#define SYS_GPB_MFP1_PB6MFP_ACMP2_P2        (0x1UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for ACMP2_P2          */
#define SYS_GPB_MFP1_PB6MFP_OPA2_P1         (0x1UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for OPA2_P1           */
#define SYS_GPB_MFP1_PB6MFP_EBI_nWRH        (0x2UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EBI_nWRH          */
#define SYS_GPB_MFP1_PB6MFP_USCI1_DAT1      (0x4UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for USCI1_DAT1        */
#define SYS_GPB_MFP1_PB6MFP_UART1_RXD       (0x6UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for UART1_RXD         */
#define SYS_GPB_MFP1_PB6MFP_EBI_nCS1        (0x8UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EBI_nCS1          */
#define SYS_GPB_MFP1_PB6MFP_PWM1_CH5        (0xAUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for PWM1_CH5          */
#define SYS_GPB_MFP1_PB6MFP_EPWM1_BRAKE1    (0xBUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EPWM1_BRAKE1      */
#define SYS_GPB_MFP1_PB6MFP_EPWM1_CH5       (0xCUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EPWM1_CH5         */
#define SYS_GPB_MFP1_PB6MFP_INT4            (0xDUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for INT4              */
#define SYS_GPB_MFP1_PB6MFP_PWM1_BRAKE1     (0xEUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for PWM1_BRAKE1       */
#define SYS_GPB_MFP1_PB6MFP_ACMP1_O         (0xFUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for ACMP1_O           */

/* PB.7 MFP */
#define SYS_GPB_MFP1_PB7MFP_GPIO            (0x0UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for GPIO              */
#define SYS_GPB_MFP1_PB7MFP_EADC0_CH7       (0x1UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EADC0_CH7         */
#define SYS_GPB_MFP1_PB7MFP_LPADC0_CH7      (0x1UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for LPADC0_CH7        */
#define SYS_GPB_MFP1_PB7MFP_ACMP2_P3        (0x1UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for ACMP2_P3          */
#define SYS_GPB_MFP1_PB7MFP_OPA2_N1         (0x1UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for OPA2_N1           */
#define SYS_GPB_MFP1_PB7MFP_EBI_nWRL        (0x2UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EBI_nWRL          */
#define SYS_GPB_MFP1_PB7MFP_USCI1_DAT0      (0x4UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for USCI1_DAT0        */
#define SYS_GPB_MFP1_PB7MFP_UART1_TXD       (0x6UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for UART1_TXD         */
#define SYS_GPB_MFP1_PB7MFP_EBI_nCS0        (0x8UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EBI_nCS0          */
#define SYS_GPB_MFP1_PB7MFP_PWM1_CH4        (0xAUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for PWM1_CH4          */
#define SYS_GPB_MFP1_PB7MFP_EPWM1_BRAKE0    (0xBUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EPWM1_BRAKE0      */
#define SYS_GPB_MFP1_PB7MFP_EPWM1_CH4       (0xCUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EPWM1_CH4         */
#define SYS_GPB_MFP1_PB7MFP_INT5            (0xDUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for INT5              */
#define SYS_GPB_MFP1_PB7MFP_PWM1_BRAKE0     (0xEUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for PWM1_BRAKE0       */
#define SYS_GPB_MFP1_PB7MFP_ACMP0_O         (0xFUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for ACMP0_O           */

/* PB.8 MFP */
#define SYS_GPB_MFP2_PB8MFP_GPIO            (0x0UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for GPIO              */
#define SYS_GPB_MFP2_PB8MFP_EADC0_CH8       (0x1UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for EADC0_CH8         */
#define SYS_GPB_MFP2_PB8MFP_LPADC0_CH8      (0x1UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for LPADC0_CH8        */
#define SYS_GPB_MFP2_PB8MFP_EBI_ADR19       (0x2UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for EBI_ADR19         */
#define SYS_GPB_MFP2_PB8MFP_USCI1_CLK       (0x4UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for USCI1_CLK         */
#define SYS_GPB_MFP2_PB8MFP_UART0_RXD       (0x5UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for UART0_RXD         */
#define SYS_GPB_MFP2_PB8MFP_UART1_nRTS      (0x6UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for UART1_nRTS        */
#define SYS_GPB_MFP2_PB8MFP_UART7_RXD       (0x8UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for UART7_RXD         */
#define SYS_GPB_MFP2_PB8MFP_PWM1_CH3        (0xAUL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for PWM1_CH3          */
#define SYS_GPB_MFP2_PB8MFP_LPUART0_RXD     (0x15UL<<SYS_GPB_MFP2_PB8MFP_Pos)   /*!< GPB_MFP2 PB8 setting for LPUART0_RXD       */

/* PB.9 MFP */
#define SYS_GPB_MFP2_PB9MFP_GPIO            (0x0UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for GPIO              */
#define SYS_GPB_MFP2_PB9MFP_EADC0_CH9       (0x1UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for EADC0_CH9         */
#define SYS_GPB_MFP2_PB9MFP_LPADC0_CH9      (0x1UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for LPADC0_CH9        */
#define SYS_GPB_MFP2_PB9MFP_EBI_ADR18       (0x2UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for EBI_ADR18         */
#define SYS_GPB_MFP2_PB9MFP_USCI1_CTL1      (0x4UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for USCI1_CTL1        */
#define SYS_GPB_MFP2_PB9MFP_UART0_TXD       (0x5UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for UART0_TXD         */
#define SYS_GPB_MFP2_PB9MFP_UART1_nCTS      (0x6UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for UART1_nCTS        */
#define SYS_GPB_MFP2_PB9MFP_UART7_TXD       (0x8UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for UART7_TXD         */
#define SYS_GPB_MFP2_PB9MFP_PWM1_CH2        (0xAUL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for PWM1_CH2          */
#define SYS_GPB_MFP2_PB9MFP_LPUART0_TXD     (0x15UL<<SYS_GPB_MFP2_PB9MFP_Pos)   /*!< GPB_MFP2 PB9 setting for LPUART0_TXD       */

/* PB.10 MFP */
#define SYS_GPB_MFP2_PB10MFP_GPIO           (0x0UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for GPIO             */
#define SYS_GPB_MFP2_PB10MFP_EADC0_CH10     (0x1UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for EADC0_CH10       */
#define SYS_GPB_MFP2_PB10MFP_LPADC0_CH10    (0x1UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for LPADC0_CH10      */
#define SYS_GPB_MFP2_PB10MFP_EBI_ADR17      (0x2UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for EBI_ADR17        */
#define SYS_GPB_MFP2_PB10MFP_USCI1_CTL0     (0x4UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for USCI1_CTL0       */
#define SYS_GPB_MFP2_PB10MFP_UART0_nRTS     (0x5UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for UART0_nRTS       */
#define SYS_GPB_MFP2_PB10MFP_UART4_RXD      (0x6UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for UART4_RXD        */
#define SYS_GPB_MFP2_PB10MFP_I2C1_SDA       (0x7UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for I2C1_SDA         */
#define SYS_GPB_MFP2_PB10MFP_CANFD1_RXD     (0x8UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for CANFD1_RXD       */
#define SYS_GPB_MFP2_PB10MFP_PWM1_CH1       (0xAUL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for PWM1_CH1         */
#define SYS_GPB_MFP2_PB10MFP_LPUART0_nRTS   (0x15UL<<SYS_GPB_MFP2_PB10MFP_Pos)  /*!< GPB_MFP2 PB10 setting for LPUART0_nRTS     */

/* PB.11 MFP */
#define SYS_GPB_MFP2_PB11MFP_GPIO           (0x0UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for GPIO             */
#define SYS_GPB_MFP2_PB11MFP_EADC0_CH11     (0x1UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for EADC0_CH11       */
#define SYS_GPB_MFP2_PB11MFP_LPADC0_CH11    (0x1UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for LPADC0_CH11      */
#define SYS_GPB_MFP2_PB11MFP_EBI_ADR16      (0x2UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for EBI_ADR16        */
#define SYS_GPB_MFP2_PB11MFP_UART0_nCTS     (0x5UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for UART0_nCTS       */
#define SYS_GPB_MFP2_PB11MFP_UART4_TXD      (0x6UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for UART4_TXD        */
#define SYS_GPB_MFP2_PB11MFP_I2C1_SCL       (0x7UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for I2C1_SCL         */
#define SYS_GPB_MFP2_PB11MFP_CANFD1_TXD     (0x8UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for CANFD1_TXD       */
#define SYS_GPB_MFP2_PB11MFP_SPI0_I2SMCLK   (0x9UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for SPI0_I2SMCLK     */
#define SYS_GPB_MFP2_PB11MFP_PWM1_CH0       (0xAUL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for PWM1_CH0         */
#define SYS_GPB_MFP2_PB11MFP_LPUART0_nCTS   (0x15UL<<SYS_GPB_MFP2_PB11MFP_Pos)  /*!< GPB_MFP2 PB11 setting for LPUART0_nCTS     */

/* PB.12 MFP */
#define SYS_GPB_MFP3_PB12MFP_GPIO           (0x0UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for GPIO             */
#define SYS_GPB_MFP3_PB12MFP_EADC0_CH12     (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for EADC0_CH12       */
#define SYS_GPB_MFP3_PB12MFP_LPADC0_CH12    (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for LPADC0_CH12      */
#define SYS_GPB_MFP3_PB12MFP_DAC0_OUT       (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for DAC0_OUT         */
#define SYS_GPB_MFP3_PB12MFP_ACMP0_P2       (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for ACMP0_P2         */
#define SYS_GPB_MFP3_PB12MFP_ACMP1_P2       (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for ACMP1_P2         */
#define SYS_GPB_MFP3_PB12MFP_EBI_AD15       (0x2UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for EBI_AD15         */
#define SYS_GPB_MFP3_PB12MFP_SPI0_MOSI      (0x4UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for SPI0_MOSI        */
#define SYS_GPB_MFP3_PB12MFP_USCI0_CLK      (0x5UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for USCI0_CLK        */
#define SYS_GPB_MFP3_PB12MFP_UART0_RXD      (0x6UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for UART0_RXD        */
#define SYS_GPB_MFP3_PB12MFP_UART3_nCTS     (0x7UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for UART3_nCTS       */
#define SYS_GPB_MFP3_PB12MFP_I2C2_SDA       (0x8UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for I2C2_SDA         */
#define SYS_GPB_MFP3_PB12MFP_CANFD0_RXD     (0xAUL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for CANFD0_RXD       */
#define SYS_GPB_MFP3_PB12MFP_EPWM1_CH3      (0xBUL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for EPWM1_CH3        */
#define SYS_GPB_MFP3_PB12MFP_TM3_EXT        (0xDUL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for TM3_EXT          */
#define SYS_GPB_MFP3_PB12MFP_LPSPI0_MOSI    (0x14UL<<SYS_GPB_MFP3_PB12MFP_Pos)  /*!< GPB_MFP3 PB12 setting for LPSPI0_MOSI      */
#define SYS_GPB_MFP3_PB12MFP_LPUART0_RXD    (0x15UL<<SYS_GPB_MFP3_PB12MFP_Pos)  /*!< GPB_MFP3 PB12 setting for LPUART0_RXD      */

