OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PB.13 MFP */
#define SYS_GPB_MFP3_PB13MFP_GPIO           (0x0UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for GPIO             */
#define SYS_GPB_MFP3_PB13MFP_EADC0_CH13     (0x1UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for EADC0_CH13       */
#define SYS_GPB_MFP3_PB13MFP_LPADC0_CH13    (0x1UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for LPADC0_CH13      */
#define SYS_GPB_MFP3_PB13MFP_DAC1_OUT       (0x1UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for DAC1_OUT         */
#define SYS_GPB_MFP3_PB13MFP_ACMP0_P3       (0x1UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for ACMP0_P3         */
#define SYS_GPB_MFP3_PB13MFP_ACMP1_P3       (0x1UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for ACMP1_P3         */
#define SYS_GPB_MFP3_PB13MFP_OPA1_N1        (0x1UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for OPA1_N1          */
#define SYS_GPB_MFP3_PB13MFP_EBI_AD14       (0x2UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for EBI_AD14         */
#define SYS_GPB_MFP3_PB13MFP_SPI0_MISO      (0x4UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for SPI0_MISO        */
#define SYS_GPB_MFP3_PB13MFP_USCI0_DAT0     (0x5UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for USCI0_DAT0       */
#define SYS_GPB_MFP3_PB13MFP_UART0_TXD      (0x6UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for UART0_TXD        */
#define SYS_GPB_MFP3_PB13MFP_UART3_nRTS     (0x7UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for UART3_nRTS       */
#define SYS_GPB_MFP3_PB13MFP_I2C2_SCL       (0x8UL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for I2C2_SCL         */
#define SYS_GPB_MFP3_PB13MFP_CANFD0_TXD     (0xAUL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for CANFD0_TXD       */
#define SYS_GPB_MFP3_PB13MFP_EPWM1_CH2      (0xBUL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for EPWM1_CH2        */
#define SYS_GPB_MFP3_PB13MFP_TM2_EXT        (0xDUL<<SYS_GPB_MFP3_PB13MFP_Pos)   /*!< GPB_MFP3 PB13 setting for TM2_EXT          */
#define SYS_GPB_MFP3_PB13MFP_LPSPI0_MISO    (0x14UL<<SYS_GPB_MFP3_PB13MFP_Pos)  /*!< GPB_MFP3 PB13 setting for LPSPI0_MISO      */
#define SYS_GPB_MFP3_PB13MFP_LPUART0_TXD    (0x15UL<<SYS_GPB_MFP3_PB13MFP_Pos)  /*!< GPB_MFP3 PB13 setting for LPUART0_TXD      */

/* PB.14 MFP */
#define SYS_GPB_MFP3_PB14MFP_GPIO           (0x0UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for GPIO             */
#define SYS_GPB_MFP3_PB14MFP_EADC0_CH14     (0x1UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for EADC0_CH14       */
#define SYS_GPB_MFP3_PB14MFP_LPADC0_CH14    (0x1UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for LPADC0_CH14      */
#define SYS_GPB_MFP3_PB14MFP_OPA0_N1        (0x1UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for OPA0_N1          */
#define SYS_GPB_MFP3_PB14MFP_EBI_AD13       (0x2UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for EBI_AD13         */
#define SYS_GPB_MFP3_PB14MFP_SPI0_CLK       (0x4UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for SPI0_CLK         */
#define SYS_GPB_MFP3_PB14MFP_USCI0_DAT1     (0x5UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for USCI0_DAT1       */
#define SYS_GPB_MFP3_PB14MFP_UART0_nRTS     (0x6UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for UART0_nRTS       */
#define SYS_GPB_MFP3_PB14MFP_UART3_RXD      (0x7UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for UART3_RXD        */
#define SYS_GPB_MFP3_PB14MFP_I2C2_SMBSUS    (0x8UL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for I2C2_SMBSUS      */
#define SYS_GPB_MFP3_PB14MFP_EQEI0_INDEX    (0xAUL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for EQEI0_INDEX      */
#define SYS_GPB_MFP3_PB14MFP_EPWM1_CH1      (0xBUL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for EPWM1_CH1        */
#define SYS_GPB_MFP3_PB14MFP_ECAP0_IC0      (0xCUL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for ECAP0_IC0        */
#define SYS_GPB_MFP3_PB14MFP_TM1_EXT        (0xDUL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for TM1_EXT          */
#define SYS_GPB_MFP3_PB14MFP_CLKO           (0xEUL<<SYS_GPB_MFP3_PB14MFP_Pos)   /*!< GPB_MFP3 PB14 setting for CLKO             */
#define SYS_GPB_MFP3_PB14MFP_TK_SE          (0x10UL<<SYS_GPB_MFP3_PB14MFP_Pos)  /*!< GPB_MFP3 PB14 setting for TK_SE            */
#define SYS_GPB_MFP3_PB14MFP_UTCPD0_VBSRCEN (0x11UL<<SYS_GPB_MFP3_PB14MFP_Pos)  /*!< GPB_MFP3 PB14 setting for UTCPD0_VBSRCEN   */
#define SYS_GPB_MFP3_PB14MFP_LPSPI0_CLK     (0x14UL<<SYS_GPB_MFP3_PB14MFP_Pos)  /*!< GPB_MFP3 PB14 setting for LPSPI0_CLK       */
#define SYS_GPB_MFP3_PB14MFP_LPUART0_nRTS   (0x15UL<<SYS_GPB_MFP3_PB14MFP_Pos)  /*!< GPB_MFP3 PB14 setting for LPUART0_nRTS     */
#define SYS_GPB_MFP3_PB14MFP_LPTM1_EXT      (0x17UL<<SYS_GPB_MFP3_PB14MFP_Pos)  /*!< GPB_MFP3 PB14 setting for LPTM1_EXT        */

/* PB.15 MFP */
#define SYS_GPB_MFP3_PB15MFP_GPIO           (0x0UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for GPIO             */
#define SYS_GPB_MFP3_PB15MFP_EADC0_CH15     (0x1UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for EADC0_CH15       */
#define SYS_GPB_MFP3_PB15MFP_LPADC0_CH15    (0x1UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for LPADC0_CH15      */
#define SYS_GPB_MFP3_PB15MFP_OPA0_P1        (0x1UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for OPA0_P1          */
#define SYS_GPB_MFP3_PB15MFP_EBI_AD12       (0x2UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for EBI_AD12         */
#define SYS_GPB_MFP3_PB15MFP_SPI0_SS        (0x4UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for SPI0_SS          */
#define SYS_GPB_MFP3_PB15MFP_USCI0_CTL1     (0x5UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for USCI0_CTL1       */
#define SYS_GPB_MFP3_PB15MFP_UART0_nCTS     (0x6UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for UART0_nCTS       */
#define SYS_GPB_MFP3_PB15MFP_UART3_TXD      (0x7UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for UART3_TXD        */
#define SYS_GPB_MFP3_PB15MFP_I2C2_SMBAL     (0x8UL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for I2C2_SMBAL       */
#define SYS_GPB_MFP3_PB15MFP_EPWM0_BRAKE1   (0xAUL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for EPWM0_BRAKE1     */
#define SYS_GPB_MFP3_PB15MFP_EPWM1_CH0      (0xBUL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for EPWM1_CH0        */
#define SYS_GPB_MFP3_PB15MFP_TM0_EXT        (0xDUL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for TM0_EXT          */
#define SYS_GPB_MFP3_PB15MFP_USB_VBUS_EN    (0xEUL<<SYS_GPB_MFP3_PB15MFP_Pos)   /*!< GPB_MFP3 PB15 setting for USB_VBUS_EN      */
#define SYS_GPB_MFP3_PB15MFP_UTCPD0_VBSNKEN (0x11UL<<SYS_GPB_MFP3_PB15MFP_Pos)  /*!< GPB_MFP3 PB15 setting for UTCPD0_VBSNKEN   */
#define SYS_GPB_MFP3_PB15MFP_LPSPI0_SS      (0x14UL<<SYS_GPB_MFP3_PB15MFP_Pos)  /*!< GPB_MFP3 PB15 setting for LPSPI0_SS        */
#define SYS_GPB_MFP3_PB15MFP_LPUART0_nCTS   (0x15UL<<SYS_GPB_MFP3_PB15MFP_Pos)  /*!< GPB_MFP3 PB15 setting for LPUART0_nCTS     */
#define SYS_GPB_MFP3_PB15MFP_LPTM0_EXT      (0x17UL<<SYS_GPB_MFP3_PB15MFP_Pos)  /*!< GPB_MFP3 PB15 setting for LPTM0_EXT        */

/* PC.0 MFP */
#define SYS_GPC_MFP0_PC0MFP_GPIO            (0x0UL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for GPIO              */
#define SYS_GPC_MFP0_PC0MFP_EBI_AD0         (0x2UL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for EBI_AD0           */
#define SYS_GPC_MFP0_PC0MFP_QSPI0_MOSI0     (0x4UL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for QSPI0_MOSI0       */
#define SYS_GPC_MFP0_PC0MFP_SPI1_SS         (0x7UL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for SPI1_SS           */
#define SYS_GPC_MFP0_PC0MFP_UART2_RXD       (0x8UL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for UART2_RXD         */
#define SYS_GPC_MFP0_PC0MFP_I2C0_SDA        (0x9UL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for I2C0_SDA          */
#define SYS_GPC_MFP0_PC0MFP_EQEI0_B         (0xAUL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for EQEI0_B           */
#define SYS_GPC_MFP0_PC0MFP_EPWM1_CH5       (0xCUL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for EPWM1_CH5         */
#define SYS_GPC_MFP0_PC0MFP_ECAP0_IC2       (0xDUL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for ECAP0_IC2         */
#define SYS_GPC_MFP0_PC0MFP_ACMP1_O         (0xEUL<<SYS_GPC_MFP0_PC0MFP_Pos)    /*!< GPC_MFP0 PC0 setting for ACMP1_O           */
#define SYS_GPC_MFP0_PC0MFP_TK_TK13         (0x10UL<<SYS_GPC_MFP0_PC0MFP_Pos)   /*!< GPC_MFP0 PC0 setting for TK_TK13           */
#define SYS_GPC_MFP0_PC0MFP_UTCPD0_CC1      (0x11UL<<SYS_GPC_MFP0_PC0MFP_Pos)   /*!< GPC_MFP0 PC0 setting for UTCPD0_CC1        */
#define SYS_GPC_MFP0_PC0MFP_LPI2C0_SDA      (0x16UL<<SYS_GPC_MFP0_PC0MFP_Pos)   /*!< GPC_MFP0 PC0 setting for LPI2C0_SDA        */
#define SYS_GPC_MFP0_PC0MFP_LPIO4           (0x17UL<<SYS_GPC_MFP0_PC0MFP_Pos)   /*!< GPC_MFP0 PC0 setting for LPIO4             */

/* PC.1 MFP */
#define SYS_GPC_MFP0_PC1MFP_GPIO            (0x0UL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for GPIO              */
#define SYS_GPC_MFP0_PC1MFP_EBI_AD1         (0x2UL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for EBI_AD1           */
#define SYS_GPC_MFP0_PC1MFP_QSPI0_MISO0     (0x4UL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for QSPI0_MISO0       */
#define SYS_GPC_MFP0_PC1MFP_SPI1_CLK        (0x7UL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for SPI1_CLK          */
#define SYS_GPC_MFP0_PC1MFP_UART2_TXD       (0x8UL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for UART2_TXD         */
#define SYS_GPC_MFP0_PC1MFP_I2C0_SCL        (0x9UL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for I2C0_SCL          */
#define SYS_GPC_MFP0_PC1MFP_EQEI0_A         (0xAUL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for EQEI0_A           */
#define SYS_GPC_MFP0_PC1MFP_EPWM1_CH4       (0xCUL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for EPWM1_CH4         */
#define SYS_GPC_MFP0_PC1MFP_ECAP0_IC1       (0xDUL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for ECAP0_IC1         */
#define SYS_GPC_MFP0_PC1MFP_ACMP0_O         (0xEUL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for ACMP0_O           */
#define SYS_GPC_MFP0_PC1MFP_EADC0_ST        (0xFUL<<SYS_GPC_MFP0_PC1MFP_Pos)    /*!< GPC_MFP0 PC1 setting for EADC0_ST          */
#define SYS_GPC_MFP0_PC1MFP_TK_TK12         (0x10UL<<SYS_GPC_MFP0_PC1MFP_Pos)   /*!< GPC_MFP0 PC1 setting for TK_TK12           */
#define SYS_GPC_MFP0_PC1MFP_UTCPD0_CC2      (0x11UL<<SYS_GPC_MFP0_PC1MFP_Pos)   /*!< GPC_MFP0 PC1 setting for UTCPD0_CC2        */
#define SYS_GPC_MFP0_PC1MFP_LPI2C0_SCL      (0x16UL<<SYS_GPC_MFP0_PC1MFP_Pos)   /*!< GPC_MFP0 PC1 setting for LPI2C0_SCL        */
#define SYS_GPC_MFP0_PC1MFP_LPIO5           (0x17UL<<SYS_GPC_MFP0_PC1MFP_Pos)   /*!< GPC_MFP0 PC1 setting for LPIO5             */

