OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PC.2 MFP */
#define SYS_GPC_MFP0_PC2MFP_GPIO            (0x0UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for GPIO              */
#define SYS_GPC_MFP0_PC2MFP_EBI_AD2         (0x2UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for EBI_AD2           */
#define SYS_GPC_MFP0_PC2MFP_QSPI0_CLK       (0x4UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for QSPI0_CLK         */
#define SYS_GPC_MFP0_PC2MFP_SPI3_MOSI       (0x6UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for SPI3_MOSI         */
#define SYS_GPC_MFP0_PC2MFP_SPI1_MOSI       (0x7UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for SPI1_MOSI         */
#define SYS_GPC_MFP0_PC2MFP_UART2_nCTS      (0x8UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for UART2_nCTS        */
#define SYS_GPC_MFP0_PC2MFP_I2C0_SMBSUS     (0x9UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for I2C0_SMBSUS       */
#define SYS_GPC_MFP0_PC2MFP_EQEI0_INDEX     (0xAUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for EQEI0_INDEX       */
#define SYS_GPC_MFP0_PC2MFP_UART3_RXD       (0xBUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for UART3_RXD         */
#define SYS_GPC_MFP0_PC2MFP_EPWM1_CH3       (0xCUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for EPWM1_CH3         */
#define SYS_GPC_MFP0_PC2MFP_ECAP0_IC0       (0xDUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for ECAP0_IC0         */
#define SYS_GPC_MFP0_PC2MFP_I2C3_SDA        (0xFUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for I2C3_SDA          */
#define SYS_GPC_MFP0_PC2MFP_TK_TK11         (0x10UL<<SYS_GPC_MFP0_PC2MFP_Pos)   /*!< GPC_MFP0 PC2 setting for TK_TK11           */
#define SYS_GPC_MFP0_PC2MFP_UTCPD0_CCDB1    (0x11UL<<SYS_GPC_MFP0_PC2MFP_Pos)   /*!< GPC_MFP0 PC2 setting for UTCPD0_CCDB1      */

/* PC.3 MFP */
#define SYS_GPC_MFP0_PC3MFP_GPIO            (0x0UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for GPIO              */
#define SYS_GPC_MFP0_PC3MFP_EBI_AD3         (0x2UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for EBI_AD3           */
#define SYS_GPC_MFP0_PC3MFP_QSPI0_SS        (0x4UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for QSPI0_SS          */
#define SYS_GPC_MFP0_PC3MFP_SPI3_MISO       (0x6UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for SPI3_MISO         */
#define SYS_GPC_MFP0_PC3MFP_SPI1_MISO       (0x7UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for SPI1_MISO         */
#define SYS_GPC_MFP0_PC3MFP_UART2_nRTS      (0x8UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for UART2_nRTS        */
#define SYS_GPC_MFP0_PC3MFP_I2C0_SMBAL      (0x9UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for I2C0_SMBAL        */
#define SYS_GPC_MFP0_PC3MFP_UART3_TXD       (0xBUL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for UART3_TXD         */
#define SYS_GPC_MFP0_PC3MFP_EPWM1_CH2       (0xCUL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for EPWM1_CH2         */
#define SYS_GPC_MFP0_PC3MFP_I2C3_SCL        (0xFUL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for I2C3_SCL          */
#define SYS_GPC_MFP0_PC3MFP_TK_TK10         (0x10UL<<SYS_GPC_MFP0_PC3MFP_Pos)   /*!< GPC_MFP0 PC3 setting for TK_TK10           */
#define SYS_GPC_MFP0_PC3MFP_UTCPD0_CCDB2    (0x11UL<<SYS_GPC_MFP0_PC3MFP_Pos)   /*!< GPC_MFP0 PC3 setting for UTCPD0_CCDB2      */

/* PC.4 MFP */
#define SYS_GPC_MFP1_PC4MFP_GPIO            (0x0UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for GPIO              */
#define SYS_GPC_MFP1_PC4MFP_EBI_AD4         (0x2UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for EBI_AD4           */
#define SYS_GPC_MFP1_PC4MFP_QSPI0_MOSI1     (0x4UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for QSPI0_MOSI1       */
#define SYS_GPC_MFP1_PC4MFP_SPI3_CLK        (0x6UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for SPI3_CLK          */
#define SYS_GPC_MFP1_PC4MFP_SPI1_I2SMCLK    (0x7UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for SPI1_I2SMCLK      */
#define SYS_GPC_MFP1_PC4MFP_UART2_RXD       (0x8UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for UART2_RXD         */
#define SYS_GPC_MFP1_PC4MFP_I2C1_SDA        (0x9UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for I2C1_SDA          */
#define SYS_GPC_MFP1_PC4MFP_CANFD0_RXD      (0xAUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for CANFD0_RXD        */
#define SYS_GPC_MFP1_PC4MFP_UART4_RXD       (0xBUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for UART4_RXD         */
#define SYS_GPC_MFP1_PC4MFP_EPWM1_CH1       (0xCUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for EPWM1_CH1         */
#define SYS_GPC_MFP1_PC4MFP_I2C3_SMBSUS     (0xFUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for I2C3_SMBSUS       */
#define SYS_GPC_MFP1_PC4MFP_TK_TK9          (0x10UL<<SYS_GPC_MFP1_PC4MFP_Pos)   /*!< GPC_MFP1 PC4 setting for TK_TK9            */
#define SYS_GPC_MFP1_PC4MFP_UTCPD0_FRSTX1   (0x11UL<<SYS_GPC_MFP1_PC4MFP_Pos)   /*!< GPC_MFP1 PC4 setting for UTCPD0_FRSTX1     */
#define SYS_GPC_MFP1_PC4MFP_UTCPD0_DISCHG   (0x12UL<<SYS_GPC_MFP1_PC4MFP_Pos)   /*!< GPC_MFP1 PC4 setting for UTCPD0_DISCHG     */

/* PC.5 MFP */
#define SYS_GPC_MFP1_PC5MFP_GPIO            (0x0UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for GPIO              */
#define SYS_GPC_MFP1_PC5MFP_EBI_AD5         (0x2UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for EBI_AD5           */
#define SYS_GPC_MFP1_PC5MFP_QSPI0_MISO1     (0x4UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for QSPI0_MISO1       */
#define SYS_GPC_MFP1_PC5MFP_SPI3_SS         (0x6UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for SPI3_SS           */
#define SYS_GPC_MFP1_PC5MFP_UART2_TXD       (0x8UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for UART2_TXD         */
#define SYS_GPC_MFP1_PC5MFP_I2C1_SCL        (0x9UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for I2C1_SCL          */
#define SYS_GPC_MFP1_PC5MFP_CANFD0_TXD      (0xAUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for CANFD0_TXD        */
#define SYS_GPC_MFP1_PC5MFP_UART4_TXD       (0xBUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for UART4_TXD         */
#define SYS_GPC_MFP1_PC5MFP_EPWM1_CH0       (0xCUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for EPWM1_CH0         */
#define SYS_GPC_MFP1_PC5MFP_I2C3_SMBAL      (0xFUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for I2C3_SMBAL        */
#define SYS_GPC_MFP1_PC5MFP_TK_TK8          (0x10UL<<SYS_GPC_MFP1_PC5MFP_Pos)   /*!< GPC_MFP1 PC5 setting for TK_TK8            */
#define SYS_GPC_MFP1_PC5MFP_UTCPD0_FRSTX2   (0x11UL<<SYS_GPC_MFP1_PC5MFP_Pos)   /*!< GPC_MFP1 PC5 setting for UTCPD0_FRSTX2     */
#define SYS_GPC_MFP1_PC5MFP_UTCPD0_DISCHG   (0x12UL<<SYS_GPC_MFP1_PC5MFP_Pos)   /*!< GPC_MFP1 PC5 setting for UTCPD0_DISCHG     */

/* PC.6 MFP */
#define SYS_GPC_MFP1_PC6MFP_GPIO            (0x0UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for GPIO              */
#define SYS_GPC_MFP1_PC6MFP_EBI_AD8         (0x2UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for EBI_AD8           */
#define SYS_GPC_MFP1_PC6MFP_SPI1_MOSI       (0x4UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for SPI1_MOSI         */
#define SYS_GPC_MFP1_PC6MFP_UART4_RXD       (0x5UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for UART4_RXD         */
#define SYS_GPC_MFP1_PC6MFP_UART0_nRTS      (0x7UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for UART0_nRTS        */
#define SYS_GPC_MFP1_PC6MFP_UART6_RXD       (0x9UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for UART6_RXD         */
#define SYS_GPC_MFP1_PC6MFP_EPWM1_CH3       (0xBUL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for EPWM1_CH3         */
#define SYS_GPC_MFP1_PC6MFP_PWM1_CH1        (0xCUL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for PWM1_CH1          */
#define SYS_GPC_MFP1_PC6MFP_TM1             (0xEUL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for TM1               */
#define SYS_GPC_MFP1_PC6MFP_INT2            (0xFUL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for INT2              */
#define SYS_GPC_MFP1_PC6MFP_LPUART0_nRTS    (0x15UL<<SYS_GPC_MFP1_PC6MFP_Pos)   /*!< GPC_MFP1 PC6 setting for LPUART0_nRTS      */
#define SYS_GPC_MFP1_PC6MFP_LPTM1           (0x17UL<<SYS_GPC_MFP1_PC6MFP_Pos)   /*!< GPC_MFP1 PC6 setting for LPTM1             */

