OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PC.13 MFP */
#define SYS_GPC_MFP3_PC13MFP_GPIO           (0x0UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for GPIO             */
#define SYS_GPC_MFP3_PC13MFP_EBI_ADR10      (0x2UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for EBI_ADR10        */
#define SYS_GPC_MFP3_PC13MFP_SPI2_I2SMCLK   (0x4UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for SPI2_I2SMCLK     */
#define SYS_GPC_MFP3_PC13MFP_CANFD1_TXD     (0x5UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for CANFD1_TXD       */
#define SYS_GPC_MFP3_PC13MFP_USCI0_CTL0     (0x6UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for USCI0_CTL0       */
#define SYS_GPC_MFP3_PC13MFP_UART2_TXD      (0x7UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for UART2_TXD        */
#define SYS_GPC_MFP3_PC13MFP_PWM0_CH4       (0x9UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for PWM0_CH4         */
#define SYS_GPC_MFP3_PC13MFP_CLKO           (0xDUL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for CLKO             */
#define SYS_GPC_MFP3_PC13MFP_EADC0_ST       (0xEUL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for EADC0_ST         */
#define SYS_GPC_MFP3_PC13MFP_TK_SE          (0x10UL<<SYS_GPC_MFP3_PC13MFP_Pos)  /*!< GPC_MFP3 PC13 setting for TK_SE            */
#define SYS_GPC_MFP3_PC13MFP_LPADC0_ST      (0x17UL<<SYS_GPC_MFP3_PC13MFP_Pos)  /*!< GPC_MFP3 PC13 setting for LPADC0_ST        */

/* PC.14 MFP */
#define SYS_GPC_MFP3_PC14MFP_GPIO           (0x0UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for GPIO             */
#define SYS_GPC_MFP3_PC14MFP_EBI_AD11       (0x2UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for EBI_AD11         */
#define SYS_GPC_MFP3_PC14MFP_SPI0_I2SMCLK   (0x4UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for SPI0_I2SMCLK     */
#define SYS_GPC_MFP3_PC14MFP_USCI0_CTL0     (0x5UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for USCI0_CTL0       */
#define SYS_GPC_MFP3_PC14MFP_QSPI0_CLK      (0x6UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for QSPI0_CLK        */
#define SYS_GPC_MFP3_PC14MFP_EBI_nCS2       (0x8UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for EBI_nCS2         */
#define SYS_GPC_MFP3_PC14MFP_EPWM0_SYNC_IN  (0xBUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for EPWM0_SYNC_IN    */
#define SYS_GPC_MFP3_PC14MFP_TM1            (0xDUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for TM1              */
#define SYS_GPC_MFP3_PC14MFP_USB_VBUS_ST    (0xEUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for USB_VBUS_ST      */
#define SYS_GPC_MFP3_PC14MFP_ACMP2_O        (0xFUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for ACMP2_O          */
#define SYS_GPC_MFP3_PC14MFP_LPTM1          (0x17UL<<SYS_GPC_MFP3_PC14MFP_Pos)  /*!< GPC_MFP3 PC14 setting for LPTM1            */

/* PD.0 MFP */
#define SYS_GPD_MFP0_PD0MFP_GPIO            (0x0UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for GPIO              */
#define SYS_GPD_MFP0_PD0MFP_EBI_AD13        (0x2UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for EBI_AD13          */
#define SYS_GPD_MFP0_PD0MFP_USCI0_CLK       (0x3UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for USCI0_CLK         */
#define SYS_GPD_MFP0_PD0MFP_SPI0_MOSI       (0x4UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for SPI0_MOSI         */
#define SYS_GPD_MFP0_PD0MFP_UART3_RXD       (0x5UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for UART3_RXD         */
#define SYS_GPD_MFP0_PD0MFP_TM2             (0xEUL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for TM2               */
#define SYS_GPD_MFP0_PD0MFP_TK_TK17         (0x10UL<<SYS_GPD_MFP0_PD0MFP_Pos)   /*!< GPD_MFP0 PD0 setting for TK_TK17           */
#define SYS_GPD_MFP0_PD0MFP_LPSPI0_MOSI     (0x14UL<<SYS_GPD_MFP0_PD0MFP_Pos)   /*!< GPD_MFP0 PD0 setting for LPSPI0_MOSI       */
#define SYS_GPD_MFP0_PD0MFP_LPIO6           (0x17UL<<SYS_GPD_MFP0_PD0MFP_Pos)   /*!< GPD_MFP0 PD0 setting for LPIO6             */

/* PD.1 MFP */
#define SYS_GPD_MFP0_PD1MFP_GPIO            (0x0UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for GPIO              */
#define SYS_GPD_MFP0_PD1MFP_EBI_AD12        (0x2UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for EBI_AD12          */
#define SYS_GPD_MFP0_PD1MFP_USCI0_DAT0      (0x3UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for USCI0_DAT0        */
#define SYS_GPD_MFP0_PD1MFP_SPI0_MISO       (0x4UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for SPI0_MISO         */
#define SYS_GPD_MFP0_PD1MFP_UART3_TXD       (0x5UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for UART3_TXD         */
#define SYS_GPD_MFP0_PD1MFP_TK_TK16         (0x10UL<<SYS_GPD_MFP0_PD1MFP_Pos)   /*!< GPD_MFP0 PD1 setting for TK_TK16           */
#define SYS_GPD_MFP0_PD1MFP_LPSPI0_MISO     (0x14UL<<SYS_GPD_MFP0_PD1MFP_Pos)   /*!< GPD_MFP0 PD1 setting for LPSPI0_MISO       */
#define SYS_GPD_MFP0_PD1MFP_LPIO7           (0x17UL<<SYS_GPD_MFP0_PD1MFP_Pos)   /*!< GPD_MFP0 PD1 setting for LPIO7             */

/* PD.2 MFP */
#define SYS_GPD_MFP0_PD2MFP_GPIO            (0x0UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for GPIO              */
#define SYS_GPD_MFP0_PD2MFP_EBI_AD11        (0x2UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for EBI_AD11          */
#define SYS_GPD_MFP0_PD2MFP_USCI0_DAT1      (0x3UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for USCI0_DAT1        */
#define SYS_GPD_MFP0_PD2MFP_SPI0_CLK        (0x4UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for SPI0_CLK          */
#define SYS_GPD_MFP0_PD2MFP_UART3_nCTS      (0x5UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for UART3_nCTS        */
#define SYS_GPD_MFP0_PD2MFP_UART0_RXD       (0x9UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for UART0_RXD         */
#define SYS_GPD_MFP0_PD2MFP_TK_TK15         (0x10UL<<SYS_GPD_MFP0_PD2MFP_Pos)   /*!< GPD_MFP0 PD2 setting for TK_TK15           */
#define SYS_GPD_MFP0_PD2MFP_LPSPI0_CLK      (0x14UL<<SYS_GPD_MFP0_PD2MFP_Pos)   /*!< GPD_MFP0 PD2 setting for LPSPI0_CLK        */
#define SYS_GPD_MFP0_PD2MFP_LPUART0_RXD     (0x15UL<<SYS_GPD_MFP0_PD2MFP_Pos)   /*!< GPD_MFP0 PD2 setting for LPUART0_RXD       */

/* PD.3 MFP */
#define SYS_GPD_MFP0_PD3MFP_GPIO            (0x0UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for GPIO              */
#define SYS_GPD_MFP0_PD3MFP_EBI_AD10        (0x2UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for EBI_AD10          */
#define SYS_GPD_MFP0_PD3MFP_USCI0_CTL1      (0x3UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for USCI0_CTL1        */
#define SYS_GPD_MFP0_PD3MFP_SPI0_SS         (0x4UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for SPI0_SS           */
#define SYS_GPD_MFP0_PD3MFP_UART3_nRTS      (0x5UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for UART3_nRTS        */
#define SYS_GPD_MFP0_PD3MFP_USCI1_CTL0      (0x6UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for USCI1_CTL0        */
#define SYS_GPD_MFP0_PD3MFP_UART0_TXD       (0x9UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for UART0_TXD         */
#define SYS_GPD_MFP0_PD3MFP_TK_TK14         (0x10UL<<SYS_GPD_MFP0_PD3MFP_Pos)   /*!< GPD_MFP0 PD3 setting for TK_TK14           */
#define SYS_GPD_MFP0_PD3MFP_LPSPI0_SS       (0x14UL<<SYS_GPD_MFP0_PD3MFP_Pos)   /*!< GPD_MFP0 PD3 setting for LPSPI0_SS         */
#define SYS_GPD_MFP0_PD3MFP_LPUART0_TXD     (0x15UL<<SYS_GPD_MFP0_PD3MFP_Pos)   /*!< GPD_MFP0 PD3 setting for LPUART0_TXD       */

/* PD.4 MFP */
#define SYS_GPD_MFP1_PD4MFP_GPIO            (0x0UL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for GPIO              */
#define SYS_GPD_MFP1_PD4MFP_USCI0_CTL0      (0x3UL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for USCI0_CTL0        */
#define SYS_GPD_MFP1_PD4MFP_I2C1_SDA        (0x4UL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for I2C1_SDA          */
#define SYS_GPD_MFP1_PD4MFP_USCI1_CTL1      (0x6UL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for USCI1_CTL1        */
#define SYS_GPD_MFP1_PD4MFP_TK_TK17         (0x10UL<<SYS_GPD_MFP1_PD4MFP_Pos)   /*!< GPD_MFP1 PD4 setting for TK_TK17           */

