OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PD.5 MFP */
#define SYS_GPD_MFP1_PD5MFP_GPIO            (0x0UL<<SYS_GPD_MFP1_PD5MFP_Pos)    /*!< GPD_MFP1 PD5 setting for GPIO              */
#define SYS_GPD_MFP1_PD5MFP_I2C1_SCL        (0x4UL<<SYS_GPD_MFP1_PD5MFP_Pos)    /*!< GPD_MFP1 PD5 setting for I2C1_SCL          */
#define SYS_GPD_MFP1_PD5MFP_USCI1_DAT0      (0x6UL<<SYS_GPD_MFP1_PD5MFP_Pos)    /*!< GPD_MFP1 PD5 setting for USCI1_DAT0        */
#define SYS_GPD_MFP1_PD5MFP_TK_TK16         (0x10UL<<SYS_GPD_MFP1_PD5MFP_Pos)   /*!< GPD_MFP1 PD5 setting for TK_TK16           */

/* PD.6 MFP */
#define SYS_GPD_MFP1_PD6MFP_GPIO            (0x0UL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for GPIO              */
#define SYS_GPD_MFP1_PD6MFP_UART1_RXD       (0x3UL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for UART1_RXD         */
#define SYS_GPD_MFP1_PD6MFP_I2C0_SDA        (0x4UL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for I2C0_SDA          */
#define SYS_GPD_MFP1_PD6MFP_USCI1_DAT1      (0x6UL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for USCI1_DAT1        */
#define SYS_GPD_MFP1_PD6MFP_TK_TK15         (0x10UL<<SYS_GPD_MFP1_PD6MFP_Pos)   /*!< GPD_MFP1 PD6 setting for TK_TK15           */
#define SYS_GPD_MFP1_PD6MFP_LPI2C0_SDA      (0x16UL<<SYS_GPD_MFP1_PD6MFP_Pos)   /*!< GPD_MFP1 PD6 setting for LPI2C0_SDA        */

/* PD.7 MFP */
#define SYS_GPD_MFP1_PD7MFP_GPIO            (0x0UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for GPIO              */
#define SYS_GPD_MFP1_PD7MFP_UART1_TXD       (0x3UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for UART1_TXD         */
#define SYS_GPD_MFP1_PD7MFP_I2C0_SCL        (0x4UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for I2C0_SCL          */
#define SYS_GPD_MFP1_PD7MFP_USCI1_CLK       (0x6UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for USCI1_CLK         */
#define SYS_GPD_MFP1_PD7MFP_TK_TK14         (0x10UL<<SYS_GPD_MFP1_PD7MFP_Pos)   /*!< GPD_MFP1 PD7 setting for TK_TK14           */
#define SYS_GPD_MFP1_PD7MFP_LPI2C0_SCL      (0x16UL<<SYS_GPD_MFP1_PD7MFP_Pos)   /*!< GPD_MFP1 PD7 setting for LPI2C0_SCL        */

/* PD.8 MFP */
#define SYS_GPD_MFP2_PD8MFP_GPIO            (0x0UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for GPIO              */
#define SYS_GPD_MFP2_PD8MFP_EBI_AD6         (0x2UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for EBI_AD6           */
#define SYS_GPD_MFP2_PD8MFP_I2C2_SDA        (0x3UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for I2C2_SDA          */
#define SYS_GPD_MFP2_PD8MFP_UART2_nRTS      (0x4UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for UART2_nRTS        */
#define SYS_GPD_MFP2_PD8MFP_UART7_RXD       (0x5UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for UART7_RXD         */

/* PD.9 MFP */
#define SYS_GPD_MFP2_PD9MFP_GPIO            (0x0UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for GPIO              */
#define SYS_GPD_MFP2_PD9MFP_EBI_AD7         (0x2UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for EBI_AD7           */
#define SYS_GPD_MFP2_PD9MFP_I2C2_SCL        (0x3UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for I2C2_SCL          */
#define SYS_GPD_MFP2_PD9MFP_UART2_nCTS      (0x4UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for UART2_nCTS        */
#define SYS_GPD_MFP2_PD9MFP_UART7_TXD       (0x5UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for UART7_TXD         */

/* PD.10 MFP */
#define SYS_GPD_MFP2_PD10MFP_GPIO           (0x0UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for GPIO             */
#define SYS_GPD_MFP2_PD10MFP_EBI_nCS2       (0x2UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for EBI_nCS2         */
#define SYS_GPD_MFP2_PD10MFP_UART1_RXD      (0x3UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for UART1_RXD        */
#define SYS_GPD_MFP2_PD10MFP_CANFD0_RXD     (0x4UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for CANFD0_RXD       */
#define SYS_GPD_MFP2_PD10MFP_EQEI0_B        (0xAUL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for EQEI0_B          */
#define SYS_GPD_MFP2_PD10MFP_INT7           (0xFUL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for INT7             */

/* PD.11 MFP */
#define SYS_GPD_MFP2_PD11MFP_GPIO           (0x0UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for GPIO             */
#define SYS_GPD_MFP2_PD11MFP_EBI_nCS1       (0x2UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for EBI_nCS1         */
#define SYS_GPD_MFP2_PD11MFP_UART1_TXD      (0x3UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for UART1_TXD        */
#define SYS_GPD_MFP2_PD11MFP_CANFD0_TXD     (0x4UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for CANFD0_TXD       */
#define SYS_GPD_MFP2_PD11MFP_EQEI0_A        (0xAUL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for EQEI0_A          */
#define SYS_GPD_MFP2_PD11MFP_INT6           (0xFUL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for INT6             */

/* PD.12 MFP */
#define SYS_GPD_MFP3_PD12MFP_GPIO           (0x0UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for GPIO             */
#define SYS_GPD_MFP3_PD12MFP_EBI_nCS0       (0x2UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for EBI_nCS0         */
#define SYS_GPD_MFP3_PD12MFP_CANFD1_RXD     (0x5UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for CANFD1_RXD       */
#define SYS_GPD_MFP3_PD12MFP_UART2_RXD      (0x7UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for UART2_RXD        */
#define SYS_GPD_MFP3_PD12MFP_PWM0_CH5       (0x9UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for PWM0_CH5         */
#define SYS_GPD_MFP3_PD12MFP_EQEI0_INDEX    (0xAUL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for EQEI0_INDEX      */
#define SYS_GPD_MFP3_PD12MFP_CLKO           (0xDUL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for CLKO             */
#define SYS_GPD_MFP3_PD12MFP_EADC0_ST       (0xEUL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for EADC0_ST         */
#define SYS_GPD_MFP3_PD12MFP_INT5           (0xFUL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for INT5             */
#define SYS_GPD_MFP3_PD12MFP_TK_SE          (0x10UL<<SYS_GPD_MFP3_PD12MFP_Pos)  /*!< GPD_MFP3 PD12 setting for TK_SE            */
#define SYS_GPD_MFP3_PD12MFP_LPADC0_ST      (0x17UL<<SYS_GPD_MFP3_PD12MFP_Pos)  /*!< GPD_MFP3 PD12 setting for LPADC0_ST        */

/* PD.13 MFP */
#define SYS_GPD_MFP3_PD13MFP_GPIO           (0x0UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for GPIO             */
#define SYS_GPD_MFP3_PD13MFP_EBI_AD10       (0x2UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for EBI_AD10         */
#define SYS_GPD_MFP3_PD13MFP_SPI0_I2SMCLK   (0x4UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for SPI0_I2SMCLK     */
#define SYS_GPD_MFP3_PD13MFP_SPI1_I2SMCLK   (0x5UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for SPI1_I2SMCLK     */
#define SYS_GPD_MFP3_PD13MFP_PWM0_CH0       (0xBUL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for PWM0_CH0         */
#define SYS_GPD_MFP3_PD13MFP_CLKO           (0xEUL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for CLKO             */
#define SYS_GPD_MFP3_PD13MFP_EADC0_ST       (0xFUL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for EADC0_ST         */
#define SYS_GPD_MFP3_PD13MFP_TK_SE          (0x10UL<<SYS_GPD_MFP3_PD13MFP_Pos)  /*!< GPD_MFP3 PD13 setting for TK_SE            */
#define SYS_GPD_MFP3_PD13MFP_LPADC0_ST      (0x17UL<<SYS_GPD_MFP3_PD13MFP_Pos)  /*!< GPD_MFP3 PD13 setting for LPADC0_ST        */

/* PD.14 MFP */
#define SYS_GPD_MFP3_PD14MFP_GPIO           (0x0UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for GPIO             */
#define SYS_GPD_MFP3_PD14MFP_EBI_nCS0       (0x2UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for EBI_nCS0         */
#define SYS_GPD_MFP3_PD14MFP_SPI3_I2SMCLK   (0x3UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for SPI3_I2SMCLK     */
#define SYS_GPD_MFP3_PD14MFP_SPI0_I2SMCLK   (0x5UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for SPI0_I2SMCLK     */
#define SYS_GPD_MFP3_PD14MFP_EPWM0_CH4      (0xBUL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for EPWM0_CH4        */

