OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PE.10 MFP */
#define SYS_GPE_MFP2_PE10MFP_GPIO           (0x0UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for GPIO             */
#define SYS_GPE_MFP2_PE10MFP_EBI_ADR12      (0x2UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for EBI_ADR12        */
#define SYS_GPE_MFP2_PE10MFP_SPI2_MOSI      (0x5UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for SPI2_MOSI        */
#define SYS_GPE_MFP2_PE10MFP_USCI1_DAT0     (0x6UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for USCI1_DAT0       */
#define SYS_GPE_MFP2_PE10MFP_UART3_TXD      (0x7UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for UART3_TXD        */
#define SYS_GPE_MFP2_PE10MFP_PWM1_BRAKE0    (0x9UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for PWM1_BRAKE0      */
#define SYS_GPE_MFP2_PE10MFP_EPWM0_CH2      (0xAUL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for EPWM0_CH2        */
#define SYS_GPE_MFP2_PE10MFP_EPWM1_BRAKE0   (0xBUL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for EPWM1_BRAKE0     */
#define SYS_GPE_MFP2_PE10MFP_ECAP0_IC2      (0xCUL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for ECAP0_IC2        */

/* PE.11 MFP */
#define SYS_GPE_MFP2_PE11MFP_GPIO           (0x0UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for GPIO             */
#define SYS_GPE_MFP2_PE11MFP_EBI_ADR13      (0x2UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for EBI_ADR13        */
#define SYS_GPE_MFP2_PE11MFP_SPI2_SS        (0x5UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for SPI2_SS          */
#define SYS_GPE_MFP2_PE11MFP_USCI1_DAT1     (0x6UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for USCI1_DAT1       */
#define SYS_GPE_MFP2_PE11MFP_UART3_RXD      (0x7UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for UART3_RXD        */
#define SYS_GPE_MFP2_PE11MFP_UART1_nCTS     (0x8UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for UART1_nCTS       */
#define SYS_GPE_MFP2_PE11MFP_PWM1_BRAKE1    (0x9UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for PWM1_BRAKE1      */
#define SYS_GPE_MFP2_PE11MFP_EPWM0_CH3      (0xAUL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for EPWM0_CH3        */
#define SYS_GPE_MFP2_PE11MFP_EPWM1_BRAKE1   (0xBUL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for EPWM1_BRAKE1     */
#define SYS_GPE_MFP2_PE11MFP_ECAP1_IC2      (0xDUL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for ECAP1_IC2        */

/* PE.12 MFP */
#define SYS_GPE_MFP3_PE12MFP_GPIO           (0x0UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for GPIO             */
#define SYS_GPE_MFP3_PE12MFP_EBI_ADR14      (0x2UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for EBI_ADR14        */
#define SYS_GPE_MFP3_PE12MFP_SPI2_I2SMCLK   (0x5UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for SPI2_I2SMCLK     */
#define SYS_GPE_MFP3_PE12MFP_USCI1_CLK      (0x6UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for USCI1_CLK        */
#define SYS_GPE_MFP3_PE12MFP_UART1_nRTS     (0x8UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for UART1_nRTS       */
#define SYS_GPE_MFP3_PE12MFP_EPWM0_CH4      (0xAUL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for EPWM0_CH4        */
#define SYS_GPE_MFP3_PE12MFP_ECAP1_IC1      (0xDUL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for ECAP1_IC1        */

/* PE.13 MFP */
#define SYS_GPE_MFP3_PE13MFP_GPIO           (0x0UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for GPIO             */
#define SYS_GPE_MFP3_PE13MFP_EBI_ADR15      (0x2UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for EBI_ADR15        */
#define SYS_GPE_MFP3_PE13MFP_I2C0_SCL       (0x4UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for I2C0_SCL         */
#define SYS_GPE_MFP3_PE13MFP_UART4_nRTS     (0x5UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for UART4_nRTS       */
#define SYS_GPE_MFP3_PE13MFP_UART1_TXD      (0x8UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for UART1_TXD        */
#define SYS_GPE_MFP3_PE13MFP_EPWM0_CH5      (0xAUL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for EPWM0_CH5        */
#define SYS_GPE_MFP3_PE13MFP_EPWM1_CH0      (0xBUL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for EPWM1_CH0        */
#define SYS_GPE_MFP3_PE13MFP_PWM1_CH5       (0xCUL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for PWM1_CH5         */
#define SYS_GPE_MFP3_PE13MFP_ECAP1_IC0      (0xDUL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for ECAP1_IC0        */
#define SYS_GPE_MFP3_PE13MFP_LPI2C0_SCL     (0x16UL<<SYS_GPE_MFP3_PE13MFP_Pos)  /*!< GPE_MFP3 PE13 setting for LPI2C0_SCL       */

/* PE.14 MFP */
#define SYS_GPE_MFP3_PE14MFP_GPIO           (0x0UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for GPIO             */
#define SYS_GPE_MFP3_PE14MFP_EBI_AD8        (0x2UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for EBI_AD8          */
#define SYS_GPE_MFP3_PE14MFP_UART2_TXD      (0x3UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for UART2_TXD        */
#define SYS_GPE_MFP3_PE14MFP_CANFD0_TXD     (0x4UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for CANFD0_TXD       */
#define SYS_GPE_MFP3_PE14MFP_UART6_TXD      (0x6UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for UART6_TXD        */
#define SYS_GPE_MFP3_PE14MFP_EPWM0_CH1      (0xCUL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for EPWM0_CH1        */
#define SYS_GPE_MFP3_PE14MFP_TM2            (0xDUL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for TM2              */
#define SYS_GPE_MFP3_PE14MFP_CLKO           (0xEUL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for CLKO             */
#define SYS_GPE_MFP3_PE14MFP_INT4           (0xFUL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for INT4             */

/* PE.15 MFP */
#define SYS_GPE_MFP3_PE15MFP_GPIO           (0x0UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for GPIO             */
#define SYS_GPE_MFP3_PE15MFP_EBI_AD9        (0x2UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for EBI_AD9          */
#define SYS_GPE_MFP3_PE15MFP_UART2_RXD      (0x3UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for UART2_RXD        */
#define SYS_GPE_MFP3_PE15MFP_CANFD0_RXD     (0x4UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for CANFD0_RXD       */
#define SYS_GPE_MFP3_PE15MFP_UART6_RXD      (0x6UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for UART6_RXD        */

/* PF.0 MFP */
#define SYS_GPF_MFP0_PF0MFP_GPIO            (0x0UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for GPIO              */
#define SYS_GPF_MFP0_PF0MFP_UART1_TXD       (0x2UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for UART1_TXD         */
#define SYS_GPF_MFP0_PF0MFP_I2C1_SCL        (0x3UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for I2C1_SCL          */
#define SYS_GPF_MFP0_PF0MFP_UART0_TXD       (0x4UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for UART0_TXD         */
#define SYS_GPF_MFP0_PF0MFP_EPWM1_CH4       (0xBUL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for EPWM1_CH4         */
#define SYS_GPF_MFP0_PF0MFP_PWM1_CH0        (0xCUL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for PWM1_CH0          */
#define SYS_GPF_MFP0_PF0MFP_ICE_DAT         (0xEUL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for ICE_DAT           */
#define SYS_GPF_MFP0_PF0MFP_UTCPD0_FRSTX2   (0x11UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for UTCPD0_FRSTX2     */
#define SYS_GPF_MFP0_PF0MFP_UTCPD0_DISCHG   (0x12UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for UTCPD0_DISCHG     */
#define SYS_GPF_MFP0_PF0MFP_LPUART0_TXD     (0x15UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for LPUART0_TXD       */
#define SYS_GPF_MFP0_PF0MFP_LPIO2           (0x17UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for LPIO2             */

/* PF.1 MFP */
#define SYS_GPF_MFP0_PF1MFP_GPIO            (0x0UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for GPIO              */
#define SYS_GPF_MFP0_PF1MFP_UART1_RXD       (0x2UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for UART1_RXD         */
#define SYS_GPF_MFP0_PF1MFP_I2C1_SDA        (0x3UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for I2C1_SDA          */
#define SYS_GPF_MFP0_PF1MFP_UART0_RXD       (0x4UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for UART0_RXD         */
#define SYS_GPF_MFP0_PF1MFP_SPI3_I2SMCLK    (0x6UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for SPI3_I2SMCLK      */
#define SYS_GPF_MFP0_PF1MFP_EPWM1_CH5       (0xBUL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for EPWM1_CH5         */
#define SYS_GPF_MFP0_PF1MFP_PWM1_CH1        (0xCUL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for PWM1_CH1          */
#define SYS_GPF_MFP0_PF1MFP_ICE_CLK         (0xEUL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for ICE_CLK           */
#define SYS_GPF_MFP0_PF1MFP_UTCPD0_FRSTX1   (0x11UL<<SYS_GPF_MFP0_PF1MFP_Pos)   /*!< GPF_MFP0 PF1 setting for UTCPD0_FRSTX1     */
#define SYS_GPF_MFP0_PF1MFP_UTCPD0_DISCHG   (0x12UL<<SYS_GPF_MFP0_PF1MFP_Pos)   /*!< GPF_MFP0 PF1 setting for UTCPD0_DISCHG     */
#define SYS_GPF_MFP0_PF1MFP_LPUART0_RXD     (0x15UL<<SYS_GPF_MFP0_PF1MFP_Pos)   /*!< GPF_MFP0 PF1 setting for LPUART0_RXD       */
#define SYS_GPF_MFP0_PF1MFP_LPIO3           (0x17UL<<SYS_GPF_MFP0_PF1MFP_Pos)   /*!< GPF_MFP0 PF1 setting for LPIO3             */

