OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PF.2 MFP */
#define SYS_GPF_MFP0_PF2MFP_GPIO            (0x0UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for GPIO              */
#define SYS_GPF_MFP0_PF2MFP_EBI_nCS1        (0x2UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for EBI_nCS1          */
#define SYS_GPF_MFP0_PF2MFP_UART0_RXD       (0x3UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for UART0_RXD         */
#define SYS_GPF_MFP0_PF2MFP_I2C0_SDA        (0x4UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for I2C0_SDA          */
#define SYS_GPF_MFP0_PF2MFP_QSPI0_CLK       (0x5UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for QSPI0_CLK         */
#define SYS_GPF_MFP0_PF2MFP_XT1_OUT         (0xAUL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for XT1_OUT           */
#define SYS_GPF_MFP0_PF2MFP_PWM1_CH1        (0xBUL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for PWM1_CH1          */
#define SYS_GPF_MFP0_PF2MFP_EQEI1_B         (0xCUL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for EQEI1_B           */
#define SYS_GPF_MFP0_PF2MFP_ECAP1_IC2       (0xDUL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for ECAP1_IC2         */
#define SYS_GPF_MFP0_PF2MFP_LPUART0_RXD     (0x15UL<<SYS_GPF_MFP0_PF2MFP_Pos)   /*!< GPF_MFP0 PF2 setting for LPUART0_RXD       */
#define SYS_GPF_MFP0_PF2MFP_LPI2C0_SDA      (0x16UL<<SYS_GPF_MFP0_PF2MFP_Pos)   /*!< GPF_MFP0 PF2 setting for LPI2C0_SDA        */

/* PF.3 MFP */
#define SYS_GPF_MFP0_PF3MFP_GPIO            (0x0UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for GPIO              */
#define SYS_GPF_MFP0_PF3MFP_EBI_nCS0        (0x2UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for EBI_nCS0          */
#define SYS_GPF_MFP0_PF3MFP_UART0_TXD       (0x3UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for UART0_TXD         */
#define SYS_GPF_MFP0_PF3MFP_I2C0_SCL        (0x4UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for I2C0_SCL          */
#define SYS_GPF_MFP0_PF3MFP_XT1_IN          (0xAUL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for XT1_IN            */
#define SYS_GPF_MFP0_PF3MFP_PWM1_CH0        (0xBUL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for PWM1_CH0          */
#define SYS_GPF_MFP0_PF3MFP_EQEI1_A         (0xCUL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for EQEI1_A           */
#define SYS_GPF_MFP0_PF3MFP_ECAP1_IC1       (0xDUL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for ECAP1_IC1         */
#define SYS_GPF_MFP0_PF3MFP_LPUART0_TXD     (0x15UL<<SYS_GPF_MFP0_PF3MFP_Pos)   /*!< GPF_MFP0 PF3 setting for LPUART0_TXD       */
#define SYS_GPF_MFP0_PF3MFP_LPI2C0_SCL      (0x16UL<<SYS_GPF_MFP0_PF3MFP_Pos)   /*!< GPF_MFP0 PF3 setting for LPI2C0_SCL        */

/* PF.4 MFP */
#define SYS_GPF_MFP1_PF4MFP_GPIO            (0x0UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for GPIO              */
#define SYS_GPF_MFP1_PF4MFP_UART2_TXD       (0x2UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for UART2_TXD         */
#define SYS_GPF_MFP1_PF4MFP_UART2_nRTS      (0x4UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for UART2_nRTS        */
#define SYS_GPF_MFP1_PF4MFP_EPWM0_CH1       (0x7UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for EPWM0_CH1         */
#define SYS_GPF_MFP1_PF4MFP_PWM0_CH5        (0x8UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for PWM0_CH5          */
#define SYS_GPF_MFP1_PF4MFP_X32_OUT         (0xAUL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for X32_OUT           */
#define SYS_GPF_MFP1_PF4MFP_EQEI1_INDEX     (0xCUL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for EQEI1_INDEX       */
#define SYS_GPF_MFP1_PF4MFP_ECAP1_IC0       (0xDUL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for ECAP1_IC0         */
#define SYS_GPF_MFP1_PF4MFP_UTCPD0_VBSRCEN  (0x11UL<<SYS_GPF_MFP1_PF4MFP_Pos)   /*!< GPF_MFP1 PF4 setting for UTCPD0_VBSRCEN    */

/* PF.5 MFP */
#define SYS_GPF_MFP1_PF5MFP_GPIO            (0x0UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for GPIO              */
#define SYS_GPF_MFP1_PF5MFP_UART2_RXD       (0x2UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for UART2_RXD         */
#define SYS_GPF_MFP1_PF5MFP_UART2_nCTS      (0x4UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for UART2_nCTS        */
#define SYS_GPF_MFP1_PF5MFP_EPWM0_CH0       (0x7UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for EPWM0_CH0         */
#define SYS_GPF_MFP1_PF5MFP_PWM0_CH4        (0x8UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for PWM0_CH4          */
#define SYS_GPF_MFP1_PF5MFP_EPWM0_SYNC_OUT  (0x9UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for EPWM0_SYNC_OUT    */
#define SYS_GPF_MFP1_PF5MFP_X32_IN          (0xAUL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for X32_IN            */
#define SYS_GPF_MFP1_PF5MFP_EADC0_ST        (0xBUL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for EADC0_ST          */
#define SYS_GPF_MFP1_PF5MFP_UTCPD0_VBSNKEN  (0x11UL<<SYS_GPF_MFP1_PF5MFP_Pos)   /*!< GPF_MFP1 PF5 setting for UTCPD0_VBSNKEN    */

/* PF.6 MFP */
#define SYS_GPF_MFP1_PF6MFP_GPIO            (0x0UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for GPIO              */
#define SYS_GPF_MFP1_PF6MFP_EBI_ADR19       (0x2UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for EBI_ADR19         */
#define SYS_GPF_MFP1_PF6MFP_SPI0_MOSI       (0x5UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for SPI0_MOSI         */
#define SYS_GPF_MFP1_PF6MFP_UART4_RXD       (0x6UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for UART4_RXD         */
#define SYS_GPF_MFP1_PF6MFP_EBI_nCS0        (0x7UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for EBI_nCS0          */
#define SYS_GPF_MFP1_PF6MFP_EPWM1_BRAKE0    (0x9UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for EPWM1_BRAKE0      */
#define SYS_GPF_MFP1_PF6MFP_TAMPER0         (0xAUL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for TAMPER0           */
#define SYS_GPF_MFP1_PF6MFP_EPWM0_BRAKE0    (0xBUL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for EPWM0_BRAKE0      */
#define SYS_GPF_MFP1_PF6MFP_EPWM0_CH4       (0xCUL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for EPWM0_CH4         */
#define SYS_GPF_MFP1_PF6MFP_PWM1_BRAKE0     (0xDUL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for PWM1_BRAKE0       */
#define SYS_GPF_MFP1_PF6MFP_PWM0_BRAKE0     (0xEUL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for PWM0_BRAKE0       */
#define SYS_GPF_MFP1_PF6MFP_CLKO            (0xFUL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for CLKO              */
#define SYS_GPF_MFP1_PF6MFP_LPSPI0_MOSI     (0x14UL<<SYS_GPF_MFP1_PF6MFP_Pos)   /*!< GPF_MFP1 PF6 setting for LPSPI0_MOSI       */

