OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PF.7 MFP */
#define SYS_GPF_MFP1_PF7MFP_GPIO            (0x0UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for GPIO              */
#define SYS_GPF_MFP1_PF7MFP_EBI_ADR18       (0x2UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for EBI_ADR18         */
#define SYS_GPF_MFP1_PF7MFP_SPI0_MISO       (0x5UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for SPI0_MISO         */
#define SYS_GPF_MFP1_PF7MFP_UART4_TXD       (0x6UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for UART4_TXD         */
#define SYS_GPF_MFP1_PF7MFP_TAMPER1         (0xAUL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for TAMPER1           */
#define SYS_GPF_MFP1_PF7MFP_TM3             (0xEUL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for TM3               */
#define SYS_GPF_MFP1_PF7MFP_INT5            (0xFUL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for INT5              */
#define SYS_GPF_MFP1_PF7MFP_LPSPI0_MISO     (0x14UL<<SYS_GPF_MFP1_PF7MFP_Pos)   /*!< GPF_MFP1 PF7 setting for LPSPI0_MISO       */

/* PF.8 MFP */
#define SYS_GPF_MFP2_PF8MFP_GPIO            (0x0UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for GPIO              */
#define SYS_GPF_MFP2_PF8MFP_EBI_ADR17       (0x2UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for EBI_ADR17         */
#define SYS_GPF_MFP2_PF8MFP_SPI0_CLK        (0x5UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for SPI0_CLK          */
#define SYS_GPF_MFP2_PF8MFP_UART5_nCTS      (0x6UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for UART5_nCTS        */
#define SYS_GPF_MFP2_PF8MFP_CANFD1_RXD      (0x8UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for CANFD1_RXD        */
#define SYS_GPF_MFP2_PF8MFP_TAMPER2         (0xAUL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for TAMPER2           */
#define SYS_GPF_MFP2_PF8MFP_LPSPI0_CLK      (0x14UL<<SYS_GPF_MFP2_PF8MFP_Pos)   /*!< GPF_MFP2 PF8 setting for LPSPI0_CLK        */

/* PF.9 MFP */
#define SYS_GPF_MFP2_PF9MFP_GPIO            (0x0UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for GPIO              */
#define SYS_GPF_MFP2_PF9MFP_EBI_ADR16       (0x2UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for EBI_ADR16         */
#define SYS_GPF_MFP2_PF9MFP_SPI0_SS         (0x5UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for SPI0_SS           */
#define SYS_GPF_MFP2_PF9MFP_UART5_nRTS      (0x6UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for UART5_nRTS        */
#define SYS_GPF_MFP2_PF9MFP_CANFD1_TXD      (0x8UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for CANFD1_TXD        */
#define SYS_GPF_MFP2_PF9MFP_LPSPI0_SS       (0x14UL<<SYS_GPF_MFP2_PF9MFP_Pos)   /*!< GPF_MFP2 PF9 setting for LPSPI0_SS         */

/* PF.10 MFP */
#define SYS_GPF_MFP2_PF10MFP_GPIO           (0x0UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for GPIO             */
#define SYS_GPF_MFP2_PF10MFP_EBI_ADR15      (0x2UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for EBI_ADR15        */
#define SYS_GPF_MFP2_PF10MFP_SPI0_I2SMCLK   (0x5UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for SPI0_I2SMCLK     */
#define SYS_GPF_MFP2_PF10MFP_UART5_RXD      (0x6UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for UART5_RXD        */

/* PF.11 MFP */
#define SYS_GPF_MFP2_PF11MFP_GPIO           (0x0UL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for GPIO             */
#define SYS_GPF_MFP2_PF11MFP_EBI_ADR14      (0x2UL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for EBI_ADR14        */
#define SYS_GPF_MFP2_PF11MFP_SPI2_MOSI      (0x3UL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for SPI2_MOSI        */
#define SYS_GPF_MFP2_PF11MFP_UART5_TXD      (0x6UL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for UART5_TXD        */
#define SYS_GPF_MFP2_PF11MFP_TM3            (0xDUL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for TM3              */

/* PG.2 MFP */
#define SYS_GPG_MFP0_PG2MFP_GPIO            (0x0UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for GPIO              */
#define SYS_GPG_MFP0_PG2MFP_EBI_ADR11       (0x2UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for EBI_ADR11         */
#define SYS_GPG_MFP0_PG2MFP_SPI2_SS         (0x3UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for SPI2_SS           */
#define SYS_GPG_MFP0_PG2MFP_I2C0_SMBAL      (0x4UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for I2C0_SMBAL        */
#define SYS_GPG_MFP0_PG2MFP_I2C1_SCL        (0x5UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for I2C1_SCL          */
#define SYS_GPG_MFP0_PG2MFP_I2C3_SMBAL      (0x9UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for I2C3_SMBAL        */
#define SYS_GPG_MFP0_PG2MFP_TM0             (0xDUL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for TM0               */
#define SYS_GPG_MFP0_PG2MFP_LPTM0           (0x17UL<<SYS_GPG_MFP0_PG2MFP_Pos)   /*!< GPG_MFP0 PG2 setting for LPTM0             */

/* PG.3 MFP */
#define SYS_GPG_MFP0_PG3MFP_GPIO            (0x0UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for GPIO              */
#define SYS_GPG_MFP0_PG3MFP_EBI_ADR12       (0x2UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for EBI_ADR12         */
#define SYS_GPG_MFP0_PG3MFP_SPI2_CLK        (0x3UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for SPI2_CLK          */
#define SYS_GPG_MFP0_PG3MFP_I2C0_SMBSUS     (0x4UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for I2C0_SMBSUS       */
#define SYS_GPG_MFP0_PG3MFP_I2C1_SDA        (0x5UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for I2C1_SDA          */
#define SYS_GPG_MFP0_PG3MFP_I2C3_SMBSUS     (0x9UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for I2C3_SMBSUS       */
#define SYS_GPG_MFP0_PG3MFP_TM1             (0xDUL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for TM1               */
#define SYS_GPG_MFP0_PG3MFP_LPTM1           (0x17UL<<SYS_GPG_MFP0_PG3MFP_Pos)   /*!< GPG_MFP0 PG3 setting for LPTM1             */

/* PG.4 MFP */
#define SYS_GPG_MFP1_PG4MFP_GPIO            (0x0UL<<SYS_GPG_MFP1_PG4MFP_Pos)    /*!< GPG_MFP1 PG4 setting for GPIO              */
#define SYS_GPG_MFP1_PG4MFP_EBI_ADR13       (0x2UL<<SYS_GPG_MFP1_PG4MFP_Pos)    /*!< GPG_MFP1 PG4 setting for EBI_ADR13         */
#define SYS_GPG_MFP1_PG4MFP_SPI2_MISO       (0x3UL<<SYS_GPG_MFP1_PG4MFP_Pos)    /*!< GPG_MFP1 PG4 setting for SPI2_MISO         */
#define SYS_GPG_MFP1_PG4MFP_TM2             (0xDUL<<SYS_GPG_MFP1_PG4MFP_Pos)    /*!< GPG_MFP1 PG4 setting for TM2               */

