OpenNuvoton/NuTool-PinConfigure/Header/M231/sys.h
/* PG.9 MFP */
#define SYS_GPG_MFP2_PG9MFP_GPIO            (0x0UL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for GPIO              */
#define SYS_GPG_MFP2_PG9MFP_EBI_AD0         (0x2UL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for EBI_AD0           */
#define SYS_GPG_MFP2_PG9MFP_PWM0_CH5        (0xCUL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for PWM0_CH5          */

/* PG.10 MFP */
#define SYS_GPG_MFP2_PG10MFP_GPIO           (0x0UL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for GPIO             */
#define SYS_GPG_MFP2_PG10MFP_EBI_AD1        (0x2UL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for EBI_AD1          */
#define SYS_GPG_MFP2_PG10MFP_PWM0_CH4       (0xCUL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for PWM0_CH4         */

/* PG.11 MFP */
#define SYS_GPG_MFP2_PG11MFP_GPIO           (0x0UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for GPIO             */
#define SYS_GPG_MFP2_PG11MFP_EBI_AD2        (0x2UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for EBI_AD2          */
#define SYS_GPG_MFP2_PG11MFP_UART7_TXD      (0x6UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for UART7_TXD        */
#define SYS_GPG_MFP2_PG11MFP_PWM0_CH3       (0xCUL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for PWM0_CH3         */

/* PG.12 MFP */
#define SYS_GPG_MFP3_PG12MFP_GPIO           (0x0UL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for GPIO             */
#define SYS_GPG_MFP3_PG12MFP_EBI_AD3        (0x2UL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for EBI_AD3          */
#define SYS_GPG_MFP3_PG12MFP_UART7_RXD      (0x6UL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for UART7_RXD        */
#define SYS_GPG_MFP3_PG12MFP_PWM0_CH2       (0xCUL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for PWM0_CH2         */

/* PG.13 MFP */
#define SYS_GPG_MFP3_PG13MFP_GPIO           (0x0UL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for GPIO             */
#define SYS_GPG_MFP3_PG13MFP_EBI_AD4        (0x2UL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for EBI_AD4          */
#define SYS_GPG_MFP3_PG13MFP_UART6_TXD      (0x6UL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for UART6_TXD        */
#define SYS_GPG_MFP3_PG13MFP_PWM0_CH1       (0xCUL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for PWM0_CH1         */

/* PG.14 MFP */
#define SYS_GPG_MFP3_PG14MFP_GPIO           (0x0UL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for GPIO             */
#define SYS_GPG_MFP3_PG14MFP_EBI_AD5        (0x2UL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for EBI_AD5          */
#define SYS_GPG_MFP3_PG14MFP_UART6_RXD      (0x6UL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for UART6_RXD        */
#define SYS_GPG_MFP3_PG14MFP_PWM0_CH0       (0xCUL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for PWM0_CH0         */

/* PG.15 MFP */
#define SYS_GPG_MFP3_PG15MFP_GPIO           (0x0UL<<SYS_GPG_MFP3_PG15MFP_Pos)   /*!< GPG_MFP3 PG15 setting for GPIO             */
#define SYS_GPG_MFP3_PG15MFP_CLKO           (0xEUL<<SYS_GPG_MFP3_PG15MFP_Pos)   /*!< GPG_MFP3 PG15 setting for CLKO             */
#define SYS_GPG_MFP3_PG15MFP_EADC0_ST       (0xFUL<<SYS_GPG_MFP3_PG15MFP_Pos)   /*!< GPG_MFP3 PG15 setting for EADC0_ST         */
#define SYS_GPG_MFP3_PG15MFP_TK_SE          (0x10UL<<SYS_GPG_MFP3_PG15MFP_Pos)  /*!< GPG_MFP3 PG15 setting for TK_SE            */
#define SYS_GPG_MFP3_PG15MFP_LPADC0_ST      (0x17UL<<SYS_GPG_MFP3_PG15MFP_Pos)  /*!< GPG_MFP3 PG15 setting for LPADC0_ST        */

/* PH.4 MFP */
#define SYS_GPH_MFP1_PH4MFP_GPIO            (0x0UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for GPIO              */
#define SYS_GPH_MFP1_PH4MFP_EBI_ADR3        (0x2UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for EBI_ADR3          */
#define SYS_GPH_MFP1_PH4MFP_SPI1_MISO       (0x3UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for SPI1_MISO         */
#define SYS_GPH_MFP1_PH4MFP_UART7_nRTS      (0x4UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for UART7_nRTS        */
#define SYS_GPH_MFP1_PH4MFP_UART6_TXD       (0x5UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for UART6_TXD         */

/* PH.5 MFP */
#define SYS_GPH_MFP1_PH5MFP_GPIO            (0x0UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for GPIO              */
#define SYS_GPH_MFP1_PH5MFP_EBI_ADR2        (0x2UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for EBI_ADR2          */
#define SYS_GPH_MFP1_PH5MFP_SPI1_MOSI       (0x3UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for SPI1_MOSI         */
#define SYS_GPH_MFP1_PH5MFP_UART7_nCTS      (0x4UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for UART7_nCTS        */
#define SYS_GPH_MFP1_PH5MFP_UART6_RXD       (0x5UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for UART6_RXD         */

/* PH.6 MFP */
#define SYS_GPH_MFP1_PH6MFP_GPIO            (0x0UL<<SYS_GPH_MFP1_PH6MFP_Pos)    /*!< GPH_MFP1 PH6 setting for GPIO              */
#define SYS_GPH_MFP1_PH6MFP_EBI_ADR1        (0x2UL<<SYS_GPH_MFP1_PH6MFP_Pos)    /*!< GPH_MFP1 PH6 setting for EBI_ADR1          */
#define SYS_GPH_MFP1_PH6MFP_SPI1_CLK        (0x3UL<<SYS_GPH_MFP1_PH6MFP_Pos)    /*!< GPH_MFP1 PH6 setting for SPI1_CLK          */
#define SYS_GPH_MFP1_PH6MFP_UART7_TXD       (0x4UL<<SYS_GPH_MFP1_PH6MFP_Pos)    /*!< GPH_MFP1 PH6 setting for UART7_TXD         */

/* PH.7 MFP */
#define SYS_GPH_MFP1_PH7MFP_GPIO            (0x0UL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for GPIO              */
#define SYS_GPH_MFP1_PH7MFP_EBI_ADR0        (0x2UL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for EBI_ADR0          */
#define SYS_GPH_MFP1_PH7MFP_SPI1_SS         (0x3UL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for SPI1_SS           */
#define SYS_GPH_MFP1_PH7MFP_UART7_RXD       (0x4UL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for UART7_RXD         */

/* PH.8 MFP */
#define SYS_GPH_MFP2_PH8MFP_GPIO            (0x0UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for GPIO              */
#define SYS_GPH_MFP2_PH8MFP_EBI_AD12        (0x2UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for EBI_AD12          */
#define SYS_GPH_MFP2_PH8MFP_QSPI0_CLK       (0x3UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for QSPI0_CLK         */
#define SYS_GPH_MFP2_PH8MFP_SPI1_CLK        (0x6UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for SPI1_CLK          */
#define SYS_GPH_MFP2_PH8MFP_UART3_nRTS      (0x7UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for UART3_nRTS        */
#define SYS_GPH_MFP2_PH8MFP_I2C1_SMBAL      (0x8UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for I2C1_SMBAL        */
#define SYS_GPH_MFP2_PH8MFP_I2C2_SCL        (0x9UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for I2C2_SCL          */
#define SYS_GPH_MFP2_PH8MFP_UART1_TXD       (0xAUL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for UART1_TXD         */

/* PH.9 MFP */
#define SYS_GPH_MFP2_PH9MFP_GPIO            (0x0UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for GPIO              */
#define SYS_GPH_MFP2_PH9MFP_EBI_AD13        (0x2UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for EBI_AD13          */
#define SYS_GPH_MFP2_PH9MFP_QSPI0_SS        (0x3UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for QSPI0_SS          */
#define SYS_GPH_MFP2_PH9MFP_SPI1_SS         (0x6UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for SPI1_SS           */
#define SYS_GPH_MFP2_PH9MFP_UART3_nCTS      (0x7UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for UART3_nCTS        */
#define SYS_GPH_MFP2_PH9MFP_I2C1_SMBSUS     (0x8UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for I2C1_SMBSUS       */
#define SYS_GPH_MFP2_PH9MFP_I2C2_SDA        (0x9UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for I2C2_SDA          */
#define SYS_GPH_MFP2_PH9MFP_UART1_RXD       (0xAUL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for UART1_RXD         */

/* PH.10 MFP */
#define SYS_GPH_MFP2_PH10MFP_GPIO           (0x0UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for GPIO             */
#define SYS_GPH_MFP2_PH10MFP_EBI_AD14       (0x2UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for EBI_AD14         */
#define SYS_GPH_MFP2_PH10MFP_QSPI0_MISO1    (0x3UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for QSPI0_MISO1      */
#define SYS_GPH_MFP2_PH10MFP_SPI1_I2SMCLK   (0x6UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for SPI1_I2SMCLK     */
#define SYS_GPH_MFP2_PH10MFP_UART4_TXD      (0x7UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for UART4_TXD        */
#define SYS_GPH_MFP2_PH10MFP_UART0_TXD      (0x8UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for UART0_TXD        */
#define SYS_GPH_MFP2_PH10MFP_LPUART0_TXD    (0x15UL<<SYS_GPH_MFP2_PH10MFP_Pos)  /*!< GPH_MFP2 PH10 setting for LPUART0_TXD      */

/* PH.11 MFP */
#define SYS_GPH_MFP2_PH11MFP_GPIO           (0x0UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for GPIO             */
#define SYS_GPH_MFP2_PH11MFP_EBI_AD15       (0x2UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for EBI_AD15         */
#define SYS_GPH_MFP2_PH11MFP_QSPI0_MOSI1    (0x3UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for QSPI0_MOSI1      */
#define SYS_GPH_MFP2_PH11MFP_UART4_RXD      (0x7UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for UART4_RXD        */
#define SYS_GPH_MFP2_PH11MFP_UART0_RXD      (0x8UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for UART0_RXD        */
#define SYS_GPH_MFP2_PH11MFP_EPWM0_CH5      (0xBUL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for EPWM0_CH5        */
#define SYS_GPH_MFP2_PH11MFP_LPUART0_RXD    (0x15UL<<SYS_GPH_MFP2_PH11MFP_Pos)  /*!< GPH_MFP2 PH11 setting for LPUART0_RXD      */


/*@}*/ /* end of group SYS_EXPORTED_CONSTANTS */


